{
    "T1055.011": {
        "name": "Extra Window Memory Injection",
        "description": "Adversaries may inject malicious code into process via Extra Window Memory (EWM) in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1053.005": {
        "name": "Scheduled Task",
        "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code."
    },
    "T1205.002": {
        "name": "Socket Filters",
        "description": "Adversaries may attach filters to a network socket to monitor then activate backdoors used for persistence or command and control."
    },
    "T1066": {
        "name": "Indicator Removal from Tools",
        "description": "If a malicious tool is detected and quarantined or otherwise curtailed, an adversary may be able to determine why the malicious tool was detected (the indicator), modify the tool by removing the indicator, and use the updated version that is no longer detected by the target's defensive systems or subsequent targets that may use similar systems.\n\nA good example of this is when malware is detected with a file signature and quarantined by anti-virus software."
    },
    "T1560.001": {
        "name": "Archive via Utility",
        "description": "Adversaries may use utilities to compress and/or encrypt collected data prior to exfiltration."
    },
    "T1021.005": {
        "name": "VNC",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to remotely control machines using Virtual Network Computing (VNC)."
    },
    "T1047": {
        "name": "Windows Management Instrumentation",
        "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads."
    },
    "T1156": {
        "name": "Malicious Shell Modification",
        "description": "Adversaries may establish persistence through executing malicious commands triggered by a user’s shell."
    },
    "T1113": {
        "name": "Screen Capture",
        "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation."
    },
    "T1027.011": {
        "name": "Fileless Storage",
        "description": "Adversaries may store data in \"fileless\" formats to conceal malicious activity from defenses."
    },
    "T1067": {
        "name": "Bootkit",
        "description": "A bootkit is a malware variant that modifies the boot sectors of a hard drive, including the Master Boot Record (MBR) and Volume Boot Record (VBR)."
    },
    "T1037": {
        "name": "Boot or Logon Initialization Scripts",
        "description": "Adversaries may use scripts automatically executed at boot or logon initialization to establish persistence.(Citation: Mandiant APT29 Eye Spy Email Nov 22)(Citation: Anomali Rocke March 2019) Initialization scripts can be used to perform administrative functions, which may often execute other programs or send information to an internal logging server."
    },
    "T1557": {
        "name": "Adversary-in-the-Middle",
        "description": "Adversaries may attempt to position themselves between two or more networked devices using an adversary-in-the-middle (AiTM) technique to support follow-on behaviors such as [Network Sniffing](https://attack.mitre.org/techniques/T1040), [Transmitted Data Manipulation](https://attack.mitre.org/techniques/T1565/002), or replay attacks ([Exploitation for Credential Access](https://attack.mitre.org/techniques/T1212))."
    },
    "T1033": {
        "name": "System Owner/User Discovery",
        "description": "Adversaries may attempt to identify the primary user, currently logged in user, set of users that commonly uses a system, or whether a user is actively using the system."
    },
    "T1583": {
        "name": "Acquire Infrastructure",
        "description": "Adversaries may buy, lease, rent, or obtain infrastructure that can be used during targeting."
    },
    "T1218.011": {
        "name": "Rundll32",
        "description": "Adversaries may abuse rundll32.exe to proxy execution of malicious code."
    },
    "T1613": {
        "name": "Container and Resource Discovery",
        "description": "Adversaries may attempt to discover containers and other resources that are available within a containers environment."
    },
    "T1583.007": {
        "name": "Serverless",
        "description": "Adversaries may purchase and configure serverless cloud infrastructure, such as Cloudflare Workers, AWS Lambda functions, or Google Apps Scripts, that can be used during targeting."
    },
    "T1143": {
        "name": "Hidden Window",
        "description": "Adversaries may implement hidden windows to conceal malicious activity from the plain sight of users."
    },
    "T1161": {
        "name": "LC_LOAD_DYLIB Addition",
        "description": "Mach-O binaries have a series of headers that are used to perform certain operations when a binary is loaded."
    },
    "T1132.001": {
        "name": "Standard Encoding",
        "description": "Adversaries may encode data with a standard data encoding system to make the content of command and control traffic more difficult to detect."
    },
    "T1027.009": {
        "name": "Embedded Payloads",
        "description": "Adversaries may embed payloads within other files to conceal malicious content from defenses."
    },
    "T1150": {
        "name": "Plist Modification",
        "description": "Property list (plist) files contain all of the information that macOS and OS X uses to configure applications and services."
    },
    "T1556.003": {
        "name": "Pluggable Authentication Modules",
        "description": "Adversaries may modify pluggable authentication modules (PAM) to access user credentials or enable otherwise unwarranted access to accounts."
    },
    "T1578.004": {
        "name": "Revert Cloud Instance",
        "description": "An adversary may revert changes made to a cloud instance after they have performed malicious activities in attempt to evade detection and remove evidence of their presence."
    },
    "T1148": {
        "name": "HISTCONTROL",
        "description": "The <code>HISTCONTROL</code> environment variable keeps track of what should be saved by the <code>history</code> command and eventually into the <code>~/.bash_history</code> file when a user logs out."
    },
    "T1592": {
        "name": "Gather Victim Host Information",
        "description": "Adversaries may gather information about the victim's hosts that can be used during targeting."
    },
    "T1596.003": {
        "name": "Digital Certificates",
        "description": "Adversaries may search public digital certificate data for information about victims that can be used during targeting."
    },
    "T1056.001": {
        "name": "Keylogging",
        "description": "Adversaries may log user keystrokes to intercept credentials as the user types them."
    },
    "T1564.012": {
        "name": "File/Path Exclusions",
        "description": "Adversaries may attempt to hide their file-based artifacts by writing them to specific folders or file names excluded from antivirus (AV) scanning and other defensive capabilities."
    },
    "T1222.002": {
        "name": "Linux and Mac File and Directory Permissions Modification",
        "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files.(Citation: Hybrid Analysis Icacls1 June 2018)(Citation: Hybrid Analysis Icacls2 May 2018) File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions."
    },
    "T1110.001": {
        "name": "Password Guessing",
        "description": "Adversaries with no prior knowledge of legitimate credentials within the system or environment may guess passwords to attempt access to accounts."
    },
    "T1216.001": {
        "name": "PubPrn",
        "description": "Adversaries may use PubPrn to proxy execution of malicious remote files."
    },
    "T1597.002": {
        "name": "Purchase Technical Data",
        "description": "Adversaries may purchase technical information about victims that can be used during targeting."
    },
    "T1003": {
        "name": "OS Credential Dumping",
        "description": "Adversaries may attempt to dump credentials to obtain account login and credential material, normally in the form of a hash or a clear text password."
    },
    "T1129": {
        "name": "Shared Modules",
        "description": "Adversaries may execute malicious payloads via loading shared modules."
    },
    "T1602": {
        "name": "Data from Configuration Repository",
        "description": "Adversaries may collect data related to managed devices from configuration repositories."
    },
    "T1561.002": {
        "name": "Disk Structure Wipe",
        "description": "Adversaries may corrupt or wipe the disk data structures on a hard drive necessary to boot a system; targeting specific critical systems or in large numbers in a network to interrupt availability to system and network resources."
    },
    "T1498.001": {
        "name": "Direct Network Flood",
        "description": "Adversaries may attempt to cause a denial of service (DoS) by directly sending a high-volume of network traffic to a target."
    },
    "T1492": {
        "name": "Stored Data Manipulation",
        "description": "Adversaries may insert, delete, or manipulate data at rest in order to manipulate external outcomes or hide activity.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating stored data, adversaries may attempt to affect a business process, organizational understanding, and decision making."
    },
    "T1574.007": {
        "name": "Path Interception by PATH Environment Variable",
        "description": "Adversaries may execute their own malicious payloads by hijacking environment variables used to load libraries."
    },
    "T1213.002": {
        "name": "Sharepoint",
        "description": "Adversaries may leverage the SharePoint repository as a source to mine valuable information."
    },
    "T1006": {
        "name": "Direct Volume Access",
        "description": "Adversaries may directly access a volume to bypass file access controls and file system monitoring."
    },
    "T1044": {
        "name": "File System Permissions Weakness",
        "description": "Processes may automatically execute specific binaries as part of their functionality or to perform other actions."
    },
    "T1588.007": {
        "name": "Artificial Intelligence",
        "description": "Adversaries may obtain access to generative artificial intelligence tools, such as large language models (LLMs), to aid various techniques during targeting."
    },
    "T1666": {
        "name": "Modify Cloud Resource Hierarchy",
        "description": "Adversaries may attempt to modify hierarchical structures in infrastructure-as-a-service (IaaS) environments in order to evade defenses."
    },
    "T1564.008": {
        "name": "Email Hiding Rules",
        "description": "Adversaries may use email rules to hide inbound emails in a compromised user's mailbox."
    },
    "T1491.002": {
        "name": "External Defacement",
        "description": "An adversary may deface systems external to an organization in an attempt to deliver messaging, intimidate, or otherwise mislead an organization or users."
    },
    "T1027.013": {
        "name": "Encrypted/Encoded File",
        "description": "Adversaries may encrypt or encode files to obfuscate strings, bytes, and other specific patterns to impede detection."
    },
    "T1171": {
        "name": "LLMNR/NBT-NS Poisoning and Relay",
        "description": "Link-Local Multicast Name Resolution (LLMNR) and NetBIOS Name Service (NBT-NS) are Microsoft Windows components that serve as alternate methods of host identification."
    },
    "T1590.005": {
        "name": "IP Addresses",
        "description": "Adversaries may gather the victim's IP addresses that can be used during targeting."
    },
    "T1499.001": {
        "name": "OS Exhaustion Flood",
        "description": "Adversaries may launch a denial of service (DoS) attack targeting an endpoint's operating system (OS)."
    },
    "T1014": {
        "name": "Rootkit",
        "description": "Adversaries may use rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components."
    },
    "T1546.013": {
        "name": "PowerShell Profile",
        "description": "Adversaries may gain persistence and elevate privileges by executing malicious content triggered by PowerShell profiles."
    },
    "T1059.007": {
        "name": "JavaScript",
        "description": "Adversaries may abuse various implementations of JavaScript for execution."
    },
    "T1590.002": {
        "name": "DNS",
        "description": "Adversaries may gather information about the victim's DNS that can be used during targeting."
    },
    "T1501": {
        "name": "Systemd Service",
        "description": "Systemd services can be used to establish persistence on a Linux system."
    },
    "T1485.001": {
        "name": "Lifecycle-Triggered Deletion",
        "description": "Adversaries may modify the lifecycle policies of a cloud storage bucket to destroy all objects stored within."
    },
    "T1514": {
        "name": "Elevated Execution with Prompt",
        "description": "Adversaries may leverage the AuthorizationExecuteWithPrivileges API to escalate privileges by prompting the user for credentials.(Citation: AppleDocs AuthorizationExecuteWithPrivileges) The purpose of this API is to give application developers an easy way to perform operations with root privileges, such as for application installation or updating."
    },
    "T1123": {
        "name": "Audio Capture",
        "description": "An adversary can leverage a computer's peripheral devices (e.g., microphones and webcams) or applications (e.g., voice and video call services) to capture audio recordings for the purpose of listening into sensitive conversations to gather information.(Citation: ESET Attor Oct 2019)\n\nMalware or scripts may be used to interact with the devices through an available API provided by the operating system or an application to capture audio."
    },
    "T1543": {
        "name": "Create or Modify System Process",
        "description": "Adversaries may create or modify system-level processes to repeatedly execute malicious payloads as part of persistence."
    },
    "T1133": {
        "name": "External Remote Services",
        "description": "Adversaries may leverage external-facing remote services to initially access and/or persist within a network."
    },
    "T1109": {
        "name": "Component Firmware",
        "description": "Some adversaries may employ sophisticated means to compromise computer components and install malicious firmware that will execute adversary code outside of the operating system and main system firmware or BIOS."
    },
    "T1546.006": {
        "name": "LC_LOAD_DYLIB Addition",
        "description": "Adversaries may establish persistence by executing malicious content triggered by the execution of tainted binaries."
    },
    "T1539": {
        "name": "Steal Web Session Cookie",
        "description": "An adversary may steal web application or service session cookies and use them to gain access to web applications or Internet services as an authenticated user without needing credentials."
    },
    "T1053.007": {
        "name": "Container Orchestration Job",
        "description": "Adversaries may abuse task scheduling functionality provided by container orchestration tools such as Kubernetes to schedule deployment of containers configured to execute malicious code."
    },
    "T1568.002": {
        "name": "Domain Generation Algorithms",
        "description": "Adversaries may make use of Domain Generation Algorithms (DGAs) to dynamically identify a destination domain for command and control traffic rather than relying on a list of static IP addresses or domains."
    },
    "T1036.007": {
        "name": "Double File Extension",
        "description": "Adversaries may abuse a double extension in the filename as a means of masquerading the true file type."
    },
    "T1548.002": {
        "name": "Bypass User Account Control",
        "description": "Adversaries may bypass UAC mechanisms to elevate process privileges on system."
    },
    "T1099": {
        "name": "Timestomp",
        "description": "Adversaries may take actions to hide the deployment of new, or modification of existing files to obfuscate their activities."
    },
    "T1496.003": {
        "name": "SMS Pumping",
        "description": "Adversaries may leverage messaging services for SMS pumping, which may impact system and/or hosted service availability.(Citation: Twilio SMS Pumping) SMS pumping is a type of telecommunications fraud whereby a threat actor first obtains a set of phone numbers from a telecommunications provider, then leverages a victim’s messaging infrastructure to send large amounts of SMS messages to numbers in that set."
    },
    "T1016.001": {
        "name": "Internet Connection Discovery",
        "description": "Adversaries may check for Internet connectivity on compromised systems."
    },
    "T1548.003": {
        "name": "Sudo and Sudo Caching",
        "description": "Adversaries may perform sudo caching and/or use the sudoers file to elevate privileges."
    },
    "T1560.003": {
        "name": "Archive via Custom Method",
        "description": "An adversary may compress or encrypt data that is collected prior to exfiltration using a custom method."
    },
    "T1578": {
        "name": "Modify Cloud Compute Infrastructure",
        "description": "An adversary may attempt to modify a cloud account's compute service infrastructure to evade defenses."
    },
    "T1584.008": {
        "name": "Network Devices",
        "description": "Adversaries may compromise third-party network devices that can be used during targeting."
    },
    "T1583.008": {
        "name": "Malvertising",
        "description": "Adversaries may purchase online advertisements that can be abused to distribute malware to victims."
    },
    "T1069": {
        "name": "Permission Groups Discovery",
        "description": "Adversaries may attempt to discover group and permission settings."
    },
    "T1114": {
        "name": "Email Collection",
        "description": "Adversaries may target user email to collect sensitive information."
    },
    "T1003.002": {
        "name": "Security Account Manager",
        "description": "Adversaries may attempt to extract credential material from the Security Account Manager (SAM) database either through in-memory techniques or through the Windows Registry where the SAM database is stored."
    },
    "T1596.002": {
        "name": "WHOIS",
        "description": "Adversaries may search public WHOIS data for information about victims that can be used during targeting."
    },
    "T1542.001": {
        "name": "System Firmware",
        "description": "Adversaries may modify system firmware to persist on systems.The BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) or Extensible Firmware Interface (EFI) are examples of system firmware that operate as the software interface between the operating system and hardware of a computer.(Citation: Wikipedia BIOS)(Citation: Wikipedia UEFI)(Citation: About UEFI)\n\nSystem firmware like BIOS and (U)EFI underly the functionality of a computer and may be modified by an adversary to perform or assist in malicious activity."
    },
    "T1594": {
        "name": "Search Victim-Owned Websites",
        "description": "Adversaries may search websites owned by the victim for information that can be used during targeting."
    },
    "T1069.003": {
        "name": "Cloud Groups",
        "description": "Adversaries may attempt to find cloud groups and permission settings."
    },
    "T1574.011": {
        "name": "Services Registry Permissions Weakness",
        "description": "Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services."
    },
    "T1596.001": {
        "name": "DNS/Passive DNS",
        "description": "Adversaries may search DNS data for information about victims that can be used during targeting."
    },
    "T1499.003": {
        "name": "Application Exhaustion Flood",
        "description": "Adversaries may target resource intensive features of applications to cause a denial of service (DoS), denying availability to those applications."
    },
    "T1163": {
        "name": "Rc.common",
        "description": "During the boot process, macOS executes <code>source /etc/rc.common</code>, which is a shell script containing various utility functions."
    },
    "T1195.001": {
        "name": "Compromise Software Dependencies and Development Tools",
        "description": "Adversaries may manipulate software dependencies and development tools prior to receipt by a final consumer for the purpose of data or system compromise."
    },
    "T1588.004": {
        "name": "Digital Certificates",
        "description": "Adversaries may buy and/or steal SSL/TLS certificates that can be used during targeting."
    },
    "T1583.002": {
        "name": "DNS Server",
        "description": "Adversaries may set up their own Domain Name System (DNS) servers that can be used during targeting."
    },
    "T1561": {
        "name": "Disk Wipe",
        "description": "Adversaries may wipe or corrupt raw disk data on specific systems or in large numbers in a network to interrupt availability to system and network resources."
    },
    "T1071.004": {
        "name": "DNS",
        "description": "Adversaries may communicate using the Domain Name System (DNS) application layer protocol to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1552.005": {
        "name": "Cloud Instance Metadata API",
        "description": "Adversaries may attempt to access the Cloud Instance Metadata API to collect credentials and other sensitive data.\n\nMost cloud service providers support a Cloud Instance Metadata API which is a service provided to running virtual instances that allows applications to access information about the running virtual instance."
    },
    "T1555.002": {
        "name": "Securityd Memory",
        "description": "An adversary with root access may gather credentials by reading `securityd`’s memory."
    },
    "T1615": {
        "name": "Group Policy Discovery",
        "description": "Adversaries may gather information on Group Policy settings to identify paths for privilege escalation, security measures applied within a domain, and to discover patterns in domain objects that can be manipulated or used to blend in the environment."
    },
    "T1542.003": {
        "name": "Bootkit",
        "description": "Adversaries may use bootkits to persist on systems."
    },
    "T1025": {
        "name": "Data from Removable Media",
        "description": "Adversaries may search connected removable media on computers they have compromised to find files of interest."
    },
    "T1116": {
        "name": "Code Signing",
        "description": "Code signing provides a level of authenticity on a binary from the developer and a guarantee that the binary has not been tampered with."
    },
    "T1218.013": {
        "name": "Mavinject",
        "description": "Adversaries may abuse mavinject.exe to proxy execution of malicious code."
    },
    "T1522": {
        "name": "Cloud Instance Metadata API",
        "description": "Adversaries may attempt to access the Cloud Instance Metadata API to collect credentials and other sensitive data.\n\nMost cloud service providers support a Cloud Instance Metadata API which is a service provided to running virtual instances that allows applications to access information about the running virtual instance."
    },
    "T1093": {
        "name": "Process Hollowing",
        "description": "Process hollowing occurs when a process is created in a suspended state then its memory is unmapped and replaced with malicious code."
    },
    "T1074.001": {
        "name": "Local Data Staging",
        "description": "Adversaries may stage collected data in a central location or directory on the local system prior to Exfiltration."
    },
    "T1036.005": {
        "name": "Match Legitimate Resource Name or Location",
        "description": "Adversaries may match or approximate the name or location of legitimate files, Registry keys, or other resources when naming/placing them."
    },
    "T1172": {
        "name": "Domain Fronting",
        "description": "Domain fronting takes advantage of routing schemes in Content Delivery Networks (CDNs) and other services which host multiple domains to obfuscate the intended destination of HTTPS traffic or traffic tunneled through HTTPS."
    },
    "T1587.003": {
        "name": "Digital Certificates",
        "description": "Adversaries may create self-signed SSL/TLS certificates that can be used during targeting."
    },
    "T1565.001": {
        "name": "Stored Data Manipulation",
        "description": "Adversaries may insert, delete, or manipulate data at rest in order to influence external outcomes or hide activity, thus threatening the integrity of the data.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating stored data, adversaries may attempt to affect a business process, organizational understanding, and decision making.\n\nStored data could include a variety of file formats, such as Office files, databases, stored emails, and custom file formats."
    },
    "T1110.002": {
        "name": "Password Cracking",
        "description": "Adversaries may use password cracking to attempt to recover usable credentials, such as plaintext passwords, when credential material such as password hashes are obtained."
    },
    "T1178": {
        "name": "SID-History Injection",
        "description": "The Windows security identifier (SID) is a unique value that identifies a user or group account."
    },
    "T1114.001": {
        "name": "Local Email Collection",
        "description": "Adversaries may target user email on local systems to collect sensitive information."
    },
    "T1555.001": {
        "name": "Keychain",
        "description": "Adversaries may acquire credentials from Keychain."
    },
    "T1547": {
        "name": "Boot or Logon Autostart Execution",
        "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems."
    },
    "T1003.004": {
        "name": "LSA Secrets",
        "description": "Adversaries with SYSTEM access to a host may attempt to access Local Security Authority (LSA) secrets, which can contain a variety of different credential materials, such as credentials for service accounts.(Citation: Passcape LSA Secrets)(Citation: Microsoft AD Admin Tier Model)(Citation: Tilbury Windows Credentials) LSA secrets are stored in the registry at <code>HKEY_LOCAL_MACHINE\\SECURITY\\Policy\\Secrets</code>."
    },
    "T1013": {
        "name": "Port Monitors",
        "description": "A port monitor can be set through the  (Citation: AddMonitor) API call to set a DLL to be loaded at startup."
    },
    "T1600": {
        "name": "Weaken Encryption",
        "description": "Adversaries may compromise a network device’s encryption capability in order to bypass encryption that would otherwise protect data communications."
    },
    "T1606.002": {
        "name": "SAML Tokens",
        "description": "An adversary may forge SAML tokens with any permissions claims and lifetimes if they possess a valid SAML token-signing certificate.(Citation: Microsoft SolarWinds Steps) The default lifetime of a SAML token is one hour, but the validity period can be specified in the <code>NotOnOrAfter</code> value of the <code>conditions ...</code> element in a token."
    },
    "T1192": {
        "name": "Spearphishing Link",
        "description": "Spearphishing with a link is a specific variant of spearphishing."
    },
    "T1036.008": {
        "name": "Masquerade File Type",
        "description": "Adversaries may masquerade malicious payloads as legitimate files through changes to the payload's formatting, including the file’s signature, extension, icon, and contents."
    },
    "T1489": {
        "name": "Service Stop",
        "description": "Adversaries may stop or disable services on a system to render those services unavailable to legitimate users."
    },
    "T1587.001": {
        "name": "Malware",
        "description": "Adversaries may develop malware and malware components that can be used during targeting."
    },
    "T1121": {
        "name": "Regsvcs/Regasm",
        "description": "Regsvcs and Regasm are Windows command-line utilities that are used to register .NET Component Object Model (COM) assemblies."
    },
    "T1652": {
        "name": "Device Driver Discovery",
        "description": "Adversaries may attempt to enumerate local device drivers on a victim host."
    },
    "T1206": {
        "name": "Sudo Caching",
        "description": "The <code>sudo</code> command \"allows a system administrator to delegate authority to give certain users (or groups of users) the ability to run some (or all) commands as root or another user while providing an audit trail of the commands and their arguments.\" (Citation: sudo man page 2018) Since sudo was made for the system administrator, it has some useful configuration features such as a <code>timestamp_timeout</code> that is the amount of time in minutes between instances of <code>sudo</code> before it will re-prompt for a password."
    },
    "T1087.002": {
        "name": "Domain Account",
        "description": "Adversaries may attempt to get a listing of domain accounts."
    },
    "T1547.014": {
        "name": "Active Setup",
        "description": "Adversaries may achieve persistence by adding a Registry key to the Active Setup of the local machine."
    },
    "T1564": {
        "name": "Hide Artifacts",
        "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection."
    },
    "T1559.002": {
        "name": "Dynamic Data Exchange",
        "description": "Adversaries may use Windows Dynamic Data Exchange (DDE) to execute arbitrary commands."
    },
    "T1204.002": {
        "name": "Malicious File",
        "description": "An adversary may rely upon a user opening a malicious file in order to gain execution."
    },
    "T1591.003": {
        "name": "Identify Business Tempo",
        "description": "Adversaries may gather information about the victim's business tempo that can be used during targeting."
    },
    "T1063": {
        "name": "Security Software Discovery",
        "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on the system."
    },
    "T1071.005": {
        "name": "Publish/Subscribe Protocols",
        "description": "Adversaries may communicate using publish/subscribe (pub/sub) application layer protocols to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1592.001": {
        "name": "Hardware",
        "description": "Adversaries may gather information about the victim's host hardware that can be used during targeting."
    },
    "T1080": {
        "name": "Taint Shared Content",
        "description": "\nAdversaries may deliver payloads to remote systems by adding content to shared storage locations, such as network drives or internal code repositories."
    },
    "T1484.002": {
        "name": "Trust Modification",
        "description": "Adversaries may add new domain trusts, modify the properties of existing domain trusts, or otherwise change the configuration of trust relationships between domains and tenants to evade defenses and/or elevate privileges.Trust details, such as whether or not user identities are federated, allow authentication and authorization properties to apply between domains or tenants for the purpose of accessing shared resources.(Citation: Microsoft - Azure AD Federation) These trust objects may include accounts, credentials, and other authentication material applied to servers, tokens, and domains.\n\nManipulating these trusts may allow an adversary to escalate privileges and/or evade defenses by modifying settings to add objects which they control."
    },
    "T1213.006": {
        "name": "Databases",
        "description": "Adversaries may leverage databases to mine valuable information."
    },
    "T1573.001": {
        "name": "Symmetric Cryptography",
        "description": "Adversaries may employ a known symmetric encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol."
    },
    "T1087.001": {
        "name": "Local Account",
        "description": "Adversaries may attempt to get a listing of local system accounts."
    },
    "T1167": {
        "name": "Securityd Memory",
        "description": "In OS X prior to El Capitan, users with root access can read plaintext keychain passwords of logged-in users because Apple’s keychain implementation allows these credentials to be cached so that users are not repeatedly prompted for passwords."
    },
    "T1586.001": {
        "name": "Social Media Accounts",
        "description": "Adversaries may compromise social media accounts that can be used during targeting."
    },
    "T1176.001": {
        "name": "Browser Extensions",
        "description": "Adversaries may abuse internet browser extensions to establish persistent access to victim systems."
    },
    "T1527": {
        "name": "Application Access Token",
        "description": "Adversaries may use application access tokens to bypass the typical authentication process and access restricted accounts, information, or services on remote systems."
    },
    "T1562.009": {
        "name": "Safe Mode Boot",
        "description": "Adversaries may abuse Windows safe mode to disable endpoint defenses."
    },
    "T1180": {
        "name": "Screensaver",
        "description": "Screensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension.(Citation: Wikipedia Screensaver) The Windows screensaver application scrnsave.scr is located in <code>C:\\Windows\\System32\\</code>, and <code>C:\\Windows\\sysWOW64\\</code> on 64-bit Windows systems, along with screensavers included with base Windows installations."
    },
    "T1542.005": {
        "name": "TFTP Boot",
        "description": "Adversaries may abuse netbooting to load an unauthorized network device operating system from a Trivial File Transfer Protocol (TFTP) server."
    },
    "T1543.003": {
        "name": "Windows Service",
        "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence."
    },
    "T1568.001": {
        "name": "Fast Flux DNS",
        "description": "Adversaries may use Fast Flux DNS to hide a command and control channel behind an array of rapidly changing IP addresses linked to a single domain resolution."
    },
    "T1497.001": {
        "name": "System Checks",
        "description": "Adversaries may employ various system checks to detect and avoid virtualization and analysis environments."
    },
    "T1053.003": {
        "name": "Cron",
        "description": "Adversaries may abuse the <code>cron</code> utility to perform task scheduling for initial or recurring execution of malicious code.(Citation: 20 macOS Common Tools and Techniques) The <code>cron</code> utility is a time-based job scheduler for Unix-like operating systems."
    },
    "T1069.002": {
        "name": "Domain Groups",
        "description": "Adversaries may attempt to find domain-level groups and permission settings."
    },
    "T1588.006": {
        "name": "Vulnerabilities",
        "description": "Adversaries may acquire information about vulnerabilities that can be used during targeting."
    },
    "T1566.002": {
        "name": "Spearphishing Link",
        "description": "Adversaries may send spearphishing emails with a malicious link in an attempt to gain access to victim systems."
    },
    "T1165": {
        "name": "Startup Items",
        "description": "Per Apple’s documentation, startup items execute during the final phase of the boot process and contain shell scripts or other executable files along with configuration information used by the system to determine the execution order for all startup items (Citation: Startup Items)."
    },
    "T1070.002": {
        "name": "Clear Linux or Mac System Logs",
        "description": "Adversaries may clear system logs to hide evidence of an intrusion."
    },
    "T1499.004": {
        "name": "Application or System Exploitation",
        "description": "Adversaries may exploit software vulnerabilities that can cause an application or system to crash and deny availability to users."
    },
    "T1137": {
        "name": "Office Application Startup",
        "description": "Adversaries may leverage Microsoft Office-based applications for persistence between startups."
    },
    "T1218.004": {
        "name": "InstallUtil",
        "description": "Adversaries may use InstallUtil to proxy execution of code through a trusted Windows utility."
    },
    "T1598.003": {
        "name": "Spearphishing Link",
        "description": "Adversaries may send spearphishing messages with a malicious link to elicit sensitive information that can be used during targeting."
    },
    "T1021.004": {
        "name": "SSH",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to log into remote machines using Secure Shell (SSH)."
    },
    "T1098.003": {
        "name": "Additional Cloud Roles",
        "description": "An adversary may add additional roles or permissions to an adversary-controlled cloud account to maintain persistent access to a tenant."
    },
    "T1547.012": {
        "name": "Print Processors",
        "description": "Adversaries may abuse print processors to run malicious DLLs during system boot for persistence and/or privilege escalation."
    },
    "T1089": {
        "name": "Disabling Security Tools",
        "description": "Adversaries may disable security tools to avoid possible detection of their tools and activities."
    },
    "T1487": {
        "name": "Disk Structure Wipe",
        "description": "Adversaries may corrupt or wipe the disk data structures on hard drive necessary to boot systems; targeting specific critical systems as well as a large number of systems in a network to interrupt availability to system and network resources."
    },
    "T1566.001": {
        "name": "Spearphishing Attachment",
        "description": "Adversaries may send spearphishing emails with a malicious attachment in an attempt to gain access to victim systems."
    },
    "T1214": {
        "name": "Credentials in Registry",
        "description": "The Windows Registry stores configuration information that can be used by the system or other programs."
    },
    "T1027.008": {
        "name": "Stripped Payloads",
        "description": "Adversaries may attempt to make a payload difficult to analyze by removing symbols, strings, and other human readable information."
    },
    "T1559.001": {
        "name": "Component Object Model",
        "description": "Adversaries may use the Windows Component Object Model (COM) for local code execution."
    },
    "T1574.001": {
        "name": "DLL",
        "description": "Adversaries may abuse dynamic-link library files (DLLs) in order to achieve persistence, escalate privileges, and evade defenses."
    },
    "T1119": {
        "name": "Automated Collection",
        "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data."
    },
    "T1115": {
        "name": "Clipboard Data",
        "description": "Adversaries may collect data stored in the clipboard from users copying information within or between applications."
    },
    "T1003.007": {
        "name": "Proc Filesystem",
        "description": "Adversaries may gather credentials from the proc filesystem or `/proc`."
    },
    "T1583.005": {
        "name": "Botnet",
        "description": "Adversaries may buy, lease, or rent a network of compromised systems that can be used during targeting."
    },
    "T1555.005": {
        "name": "Password Managers",
        "description": "Adversaries may acquire user credentials from third-party password managers.(Citation: ise Password Manager February 2019) Password managers are applications designed to store user credentials, normally in an encrypted database."
    },
    "T1103": {
        "name": "AppInit DLLs",
        "description": "Dynamic-link libraries (DLLs) that are specified in the AppInit_DLLs value in the Registry keys <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows</code> or <code>HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows</code> are loaded by user32.dll into every process that loads user32.dll."
    },
    "T1553.001": {
        "name": "Gatekeeper Bypass",
        "description": "Adversaries may modify file attributes and subvert Gatekeeper functionality to evade user prompts and execute untrusted programs."
    },
    "T1675": {
        "name": "ESXi Administration Command",
        "description": "Adversaries may abuse ESXi administration services to execute commands on guest machines hosted within an ESXi virtual environment."
    },
    "T1608.004": {
        "name": "Drive-by Target",
        "description": "Adversaries may prepare an operational environment to infect systems that visit a website over the normal course of browsing."
    },
    "T1007": {
        "name": "System Service Discovery",
        "description": "Adversaries may try to gather information about registered local system services."
    },
    "T1040": {
        "name": "Network Sniffing",
        "description": "Adversaries may passively sniff network traffic to capture information about an environment, including authentication material passed over the network."
    },
    "T1017": {
        "name": "Application Deployment Software",
        "description": "Adversaries may deploy malicious software to systems within a network using application deployment systems employed by enterprise administrators."
    },
    "T1553.002": {
        "name": "Code Signing",
        "description": "Adversaries may create, acquire, or steal code signing materials to sign their malware or tools."
    },
    "T1530": {
        "name": "Data from Cloud Storage",
        "description": "Adversaries may access data from cloud storage.\n\nMany IaaS providers offer solutions for online data object storage such as Amazon S3, Azure Storage, and Google Cloud Storage."
    },
    "T1565.003": {
        "name": "Runtime Data Manipulation",
        "description": "Adversaries may modify systems in order to manipulate the data as it is accessed and displayed to an end user, thus threatening the integrity of the data.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating runtime data, adversaries may attempt to affect a business process, organizational understanding, and decision making.\n\nAdversaries may alter application binaries used to display data in order to cause runtime manipulations."
    },
    "T1552.002": {
        "name": "Credentials in Registry",
        "description": "Adversaries may search the Registry on compromised systems for insecurely stored credentials."
    },
    "T1135": {
        "name": "Network Share Discovery",
        "description": "Adversaries may look for folders and drives shared on remote systems as a means of identifying sources of information to gather as a precursor for Collection and to identify potential systems of interest for Lateral Movement."
    },
    "T1120": {
        "name": "Peripheral Device Discovery",
        "description": "Adversaries may attempt to gather information about attached peripheral devices and components connected to a computer system.(Citation: Peripheral Discovery Linux)(Citation: Peripheral Discovery macOS) Peripheral devices could include auxiliary resources that support a variety of functionalities such as keyboards, printers, cameras, smart card readers, or removable storage."
    },
    "T1036.009": {
        "name": "Break Process Trees",
        "description": "An adversary may attempt to evade process tree-based analysis by modifying executed malware's parent process ID (PPID)."
    },
    "T1590.004": {
        "name": "Network Topology",
        "description": "Adversaries may gather information about the victim's network topology that can be used during targeting."
    },
    "T1587.002": {
        "name": "Code Signing Certificates",
        "description": "Adversaries may create self-signed code signing certificates that can be used during targeting."
    },
    "T1222.001": {
        "name": "Windows File and Directory Permissions Modification",
        "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files.(Citation: Hybrid Analysis Icacls1 June 2018)(Citation: Hybrid Analysis Icacls2 May 2018) File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions."
    },
    "T1137.006": {
        "name": "Add-ins",
        "description": "Adversaries may abuse Microsoft Office add-ins to obtain persistence on a compromised system."
    },
    "T1505.002": {
        "name": "Transport Agent",
        "description": "Adversaries may abuse Microsoft transport agents to establish persistent access to systems."
    },
    "T1082": {
        "name": "System Information Discovery",
        "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture."
    },
    "T1071": {
        "name": "Application Layer Protocol",
        "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1574.014": {
        "name": "AppDomainManager",
        "description": "Adversaries may execute their own malicious payloads by hijacking how the .NET `AppDomainManager` loads assemblies."
    },
    "T1074.002": {
        "name": "Remote Data Staging",
        "description": "Adversaries may stage data collected from multiple systems in a central location or directory on one system prior to Exfiltration."
    },
    "T1098.006": {
        "name": "Additional Container Cluster Roles",
        "description": "An adversary may add additional roles or permissions to an adversary-controlled user or service account to maintain persistent access to a container orchestration system."
    },
    "T1053": {
        "name": "Scheduled Task/Job",
        "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code."
    },
    "T1218.007": {
        "name": "Msiexec",
        "description": "Adversaries may abuse msiexec.exe to proxy execution of malicious payloads."
    },
    "T1162": {
        "name": "Login Item",
        "description": "MacOS provides the option to list specific applications to run when a user logs in."
    },
    "T1590.003": {
        "name": "Network Trust Dependencies",
        "description": "Adversaries may gather information about the victim's network trust dependencies that can be used during targeting."
    },
    "T1498.002": {
        "name": "Reflection Amplification",
        "description": "Adversaries may attempt to cause a denial of service (DoS) by reflecting a high-volume of network traffic to a target."
    },
    "T1556.002": {
        "name": "Password Filter DLL",
        "description": "Adversaries may register malicious password filter dynamic link libraries (DLLs) into the authentication process to acquire user credentials as they are validated."
    },
    "T1505.005": {
        "name": "Terminal Services DLL",
        "description": "Adversaries may abuse components of Terminal Services to enable persistent access to systems."
    },
    "T1059.002": {
        "name": "AppleScript",
        "description": "Adversaries may abuse AppleScript for execution."
    },
    "T1176": {
        "name": "Software Extensions",
        "description": "Adversaries may abuse software extensions to establish persistent access to victim systems."
    },
    "T1499.002": {
        "name": "Service Exhaustion Flood",
        "description": "Adversaries may target the different network services provided by systems to conduct a denial of service (DoS)."
    },
    "T1195.003": {
        "name": "Compromise Hardware Supply Chain",
        "description": "Adversaries may manipulate hardware components in products prior to receipt by a final consumer for the purpose of data or system compromise."
    },
    "T1106": {
        "name": "Native API",
        "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors."
    },
    "T1558.005": {
        "name": "Ccache Files",
        "description": "\nAdversaries may attempt to steal Kerberos tickets stored in credential cache files (or ccache)."
    },
    "T1070.007": {
        "name": "Clear Network Connection History and Configurations",
        "description": "Adversaries may clear or remove evidence of malicious network connections in order to clean up traces of their operations."
    },
    "T1558.004": {
        "name": "AS-REP Roasting",
        "description": "Adversaries may reveal credentials of accounts that have disabled Kerberos preauthentication by [Password Cracking](https://attack.mitre.org/techniques/T1110/002) Kerberos messages.(Citation: Harmj0y Roasting AS-REPs Jan 2017) \n\nPreauthentication offers protection against offline [Password Cracking](https://attack.mitre.org/techniques/T1110/002)."
    },
    "T1058": {
        "name": "Service Registry Permissions Weakness",
        "description": "Windows stores local service configuration information in the Registry under <code>HKLM\\SYSTEM\\CurrentControlSet\\Services</code>."
    },
    "T1584.003": {
        "name": "Virtual Private Server",
        "description": "Adversaries may compromise third-party Virtual Private Servers (VPSs) that can be used during targeting."
    },
    "T1059.010": {
        "name": "AutoHotKey & AutoIT",
        "description": "Adversaries may execute commands and perform malicious tasks using AutoIT and AutoHotKey automation scripts."
    },
    "T1600.001": {
        "name": "Reduce Key Space",
        "description": "Adversaries may reduce the level of effort required to decrypt data transmitted over the network by reducing the cipher strength of encrypted communications.(Citation: Cisco Synful Knock Evolution)\n\nAdversaries can weaken the encryption software on a compromised network device by reducing the key size used by the software to convert plaintext to ciphertext (e.g., from hundreds or thousands of bytes to just a couple of bytes)."
    },
    "T1070.003": {
        "name": "Clear Command History",
        "description": "In addition to clearing system logs, an adversary may clear the command history of a compromised account to conceal the actions undertaken during an intrusion."
    },
    "T1202": {
        "name": "Indirect Command Execution",
        "description": "Adversaries may abuse utilities that allow for command execution to bypass security restrictions that limit the use of command-line interpreters."
    },
    "T1024": {
        "name": "Custom Cryptographic Protocol",
        "description": "Adversaries may use a custom cryptographic protocol or algorithm to hide command and control traffic."
    },
    "T1536": {
        "name": "Revert Cloud Instance",
        "description": "An adversary may revert changes made to a cloud instance after they have performed malicious activities in attempt to evade detection and remove evidence of their presence."
    },
    "T1091": {
        "name": "Replication Through Removable Media",
        "description": "Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes."
    },
    "T1005": {
        "name": "Data from Local System",
        "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\n\nAdversaries may do this using a [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059), such as [cmd](https://attack.mitre.org/software/S0106) as well as a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008), which have functionality to interact with the file system to gather information.(Citation: show_run_config_cmd_cisco) Adversaries may also use [Automated Collection](https://attack.mitre.org/techniques/T1119) on the local system.\n."
    },
    "T1140": {
        "name": "Deobfuscate/Decode Files or Information",
        "description": "Adversaries may use [Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027) to hide artifacts of an intrusion from analysis."
    },
    "T1137.005": {
        "name": "Outlook Rules",
        "description": "Adversaries may abuse Microsoft Outlook rules to obtain persistence on a compromised system."
    },
    "T1562": {
        "name": "Impair Defenses",
        "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms."
    },
    "T1586.003": {
        "name": "Cloud Accounts",
        "description": "Adversaries may compromise cloud accounts that can be used during targeting."
    },
    "T1586.002": {
        "name": "Email Accounts",
        "description": "Adversaries may compromise email accounts that can be used during targeting."
    },
    "T1098.007": {
        "name": "Additional Local or Domain Groups",
        "description": "An adversary may add additional local or domain groups to an adversary-controlled account to maintain persistent access to a system or domain.\n\nOn Windows, accounts may use the `net localgroup` and `net group` commands to add existing users to local and domain groups.(Citation: Microsoft Net Localgroup)(Citation: Microsoft Net Group) On Linux, adversaries may use the `usermod` command for the same purpose.(Citation: Linux Usermod)\n\nFor example, accounts may be added to the local administrators group on Windows devices to maintain elevated privileges."
    },
    "T1608.001": {
        "name": "Upload Malware",
        "description": "Adversaries may upload malware to third-party or adversary controlled infrastructure to make it accessible during targeting."
    },
    "T1195": {
        "name": "Supply Chain Compromise",
        "description": "Adversaries may manipulate products or product delivery mechanisms prior to receipt by a final consumer for the purpose of data or system compromise.\n\nSupply chain compromise can take place at any stage of the supply chain including:\n\n* Manipulation of development tools\n* Manipulation of a development environment\n* Manipulation of source code repositories (public or private)\n* Manipulation of source code in open-source dependencies\n* Manipulation of software update/distribution mechanisms\n* Compromised/infected system images (removable media infected at the factory)(Citation: IBM Storwize)(Citation: Schneider Electric USB Malware) \n* Replacement of legitimate software with modified versions\n* Sales of modified/counterfeit products to legitimate distributors\n* Shipment interdiction\n\nWhile supply chain compromise can impact any component of hardware or software, adversaries looking to gain execution have often focused on malicious additions to legitimate software in software distribution or update channels.(Citation: Avast CCleaner3 2018)(Citation: Microsoft Dofoil 2018)(Citation: Command Five SK 2011) Adversaries may limit targeting to a desired victim set or distribute malicious software to a broad set of consumers but only follow up with specific victims.(Citation: Symantec Elderwood Sept 2012)(Citation: Avast CCleaner3 2018)(Citation: Command Five SK 2011) Popular open-source projects that are used as dependencies in many applications may also be targeted as a means to add malicious code to users of the dependency.(Citation: Trendmicro NPM Compromise)\n\nIn some cases, adversaries may conduct “second-order” supply chain compromises by leveraging the access gained from an initial supply chain compromise to further compromise a software component.(Citation: Krebs 3cx overview 2023) This may allow the threat actor to spread to even more victims."
    },
    "T1190": {
        "name": "Exploit Public-Facing Application",
        "description": "Adversaries may attempt to exploit a weakness in an Internet-facing host or system to initially access a network."
    },
    "T1558": {
        "name": "Steal or Forge Kerberos Tickets",
        "description": "Adversaries may attempt to subvert Kerberos authentication by stealing or forging Kerberos tickets to enable [Pass the Ticket](https://attack.mitre.org/techniques/T1550/003)."
    },
    "T1555": {
        "name": "Credentials from Password Stores",
        "description": "Adversaries may search for common password storage locations to obtain user credentials.(Citation: F-Secure The Dukes) Passwords are stored in several places on a system, depending on the operating system or application holding the credentials."
    },
    "T1567": {
        "name": "Exfiltration Over Web Service",
        "description": "Adversaries may use an existing, legitimate external Web service to exfiltrate data rather than their primary command and control channel."
    },
    "T1219": {
        "name": "Remote Access Tools",
        "description": "An adversary may use legitimate remote access tools to establish an interactive command and control channel within a network."
    },
    "T1583.001": {
        "name": "Domains",
        "description": "Adversaries may acquire domains that can be used during targeting."
    },
    "T1560.002": {
        "name": "Archive via Library",
        "description": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party libraries."
    },
    "T1055.003": {
        "name": "Thread Execution Hijacking",
        "description": "Adversaries may inject malicious code into hijacked processes in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1079": {
        "name": "Multilayer Encryption",
        "description": "An adversary performs C2 communications using multiple layers of encryption, typically (but not exclusively) tunneling a custom encryption scheme within a protocol encryption scheme such as HTTPS or SMTPS.."
    },
    "T1036": {
        "name": "Masquerading",
        "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools."
    },
    "T1546.011": {
        "name": "Application Shimming",
        "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by application shims."
    },
    "T1552": {
        "name": "Unsecured Credentials",
        "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials."
    },
    "T1547.010": {
        "name": "Port Monitors",
        "description": "Adversaries may use port monitors to run an adversary supplied DLL during system boot for persistence or privilege escalation."
    },
    "T1070.008": {
        "name": "Clear Mailbox Data",
        "description": "Adversaries may modify mail and mail application data to remove evidence of their activity."
    },
    "T1037.002": {
        "name": "Login Hook",
        "description": "Adversaries may use a Login Hook to establish persistence executed upon user logon."
    },
    "T1659": {
        "name": "Content Injection",
        "description": "Adversaries may gain access and continuously communicate with victims by injecting malicious content into systems through online network traffic."
    },
    "T1055": {
        "name": "Process Injection",
        "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1567.004": {
        "name": "Exfiltration Over Webhook",
        "description": "Adversaries may exfiltrate data to a webhook endpoint rather than over their primary command and control channel."
    },
    "T1139": {
        "name": "Bash History",
        "description": "Bash keeps track of the commands users type on the command-line with the \"history\" utility."
    },
    "T1205": {
        "name": "Traffic Signaling",
        "description": "Adversaries may use traffic signaling to hide open ports or other malicious functionality used for persistence or command and control."
    },
    "T1021.008": {
        "name": "Direct Cloud VM Connections",
        "description": "Adversaries may leverage [Valid Accounts](https://attack.mitre.org/techniques/T1078) to log directly into accessible cloud hosted compute infrastructure through cloud native methods."
    },
    "T1503": {
        "name": "Credentials from Web Browsers",
        "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser."
    },
    "T1218": {
        "name": "System Binary Proxy Execution",
        "description": "Adversaries may bypass process and/or signature-based defenses by proxying execution of malicious content with signed, or otherwise trusted, binaries."
    },
    "T1153": {
        "name": "Source",
        "description": "**This technique has been deprecated and should no longer be used.**\n\nThe <code>source</code> command loads functions into the current shell or executes files in the current context."
    },
    "T1038": {
        "name": "DLL Search Order Hijacking",
        "description": "Windows systems use a common method to look for required DLLs to load into a program."
    },
    "T1050": {
        "name": "New Service",
        "description": "When operating systems boot up, they can start programs or applications called services that perform background system functions."
    },
    "T1070.006": {
        "name": "Timestomp",
        "description": "Adversaries may modify file time attributes to hide new files or changes to existing files."
    },
    "T1557.004": {
        "name": "Evil Twin",
        "description": "Adversaries may host seemingly genuine Wi-Fi access points to deceive users into connecting to malicious networks as a way of supporting follow-on behaviors such as [Network Sniffing](https://attack.mitre.org/techniques/T1040), [Transmitted Data Manipulation](https://attack.mitre.org/techniques/T1565/002), or [Input Capture](https://attack.mitre.org/techniques/T1056).(Citation: Australia ‘Evil Twin’)\n\nBy using a Service Set Identifier (SSID) of a legitimate Wi-Fi network, fraudulent Wi-Fi access points may trick devices or users into connecting to malicious Wi-Fi networks.(Citation: Kaspersky evil twin)(Citation: medium evil twin)  Adversaries may provide a stronger signal strength or block access to Wi-Fi access points to coerce or entice victim devices into connecting to malicious networks.(Citation: specter ops evil twin)  A Wi-Fi Pineapple – a network security auditing and penetration testing tool – may be deployed in Evil Twin attacks for ease of use and broader range."
    },
    "T1620": {
        "name": "Reflective Code Loading",
        "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads."
    },
    "T1016.002": {
        "name": "Wi-Fi Discovery",
        "description": "Adversaries may search for information about Wi-Fi networks, such as network names and passwords, on compromised systems."
    },
    "T1480.002": {
        "name": "Mutual Exclusion",
        "description": "Adversaries may constrain execution or actions based on the presence of a mutex associated with malware."
    },
    "T1564.011": {
        "name": "Ignore Process Interrupts",
        "description": "Adversaries may evade defensive mechanisms by executing commands that hide from process interrupt signals."
    },
    "T1611": {
        "name": "Escape to Host",
        "description": "Adversaries may break out of a container or virtualized environment to gain access to the underlying host."
    },
    "T1518.002": {
        "name": "Backup Software Discovery",
        "description": "Adversaries may attempt to get a listing of backup software or configurations that are installed on a system."
    },
    "T1547.009": {
        "name": "Shortcut Modification",
        "description": "Adversaries may create or modify shortcuts that can execute a program during system boot or user login."
    },
    "T1010": {
        "name": "Application Window Discovery",
        "description": "Adversaries may attempt to get a listing of open application windows."
    },
    "T1569.003": {
        "name": "Systemctl",
        "description": "Adversaries may abuse systemctl to execute commands or programs."
    },
    "T1032": {
        "name": "Standard Cryptographic Protocol",
        "description": "Adversaries may explicitly employ a known encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol."
    },
    "T1087.003": {
        "name": "Email Account",
        "description": "Adversaries may attempt to get a listing of email addresses and accounts."
    },
    "T1062": {
        "name": "Hypervisor",
        "description": "**This technique has been deprecated and should no longer be used.**\n\nA type-1 hypervisor is a software layer that sits between the guest operating systems and system's hardware."
    },
    "T1497.003": {
        "name": "Time Based Checks",
        "description": "Adversaries may employ various time-based methods to detect virtualization and analysis environments, particularly those that attempt to manipulate time mechanisms to simulate longer elapses of time."
    },
    "T1182": {
        "name": "AppCert DLLs",
        "description": "Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs Registry key under <code>HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager</code> are loaded into every process that calls the ubiquitously used application programming interface (API) functions CreateProcess, CreateProcessAsUser, CreateProcessWithLoginW, CreateProcessWithTokenW, or WinExec."
    },
    "T1218.003": {
        "name": "CMSTP",
        "description": "Adversaries may abuse CMSTP to proxy execution of malicious code."
    },
    "T1563.001": {
        "name": "SSH Hijacking",
        "description": "Adversaries may hijack a legitimate user's SSH session to move laterally within an environment."
    },
    "T1562.002": {
        "name": "Disable Windows Event Logging",
        "description": "Adversaries may disable Windows event logging to limit data that can be leveraged for detections and audits."
    },
    "T1029": {
        "name": "Scheduled Transfer",
        "description": "Adversaries may schedule data exfiltration to be performed only at certain times of day or at certain intervals."
    },
    "T1021.002": {
        "name": "SMB/Windows Admin Shares",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to interact with a remote network share using Server Message Block (SMB)."
    },
    "T1525": {
        "name": "Implant Internal Image",
        "description": "Adversaries may implant cloud or container images with malicious code to establish persistence after gaining access to an environment."
    },
    "T1572": {
        "name": "Protocol Tunneling",
        "description": "Adversaries may tunnel network communications to and from a victim system within a separate protocol to avoid detection/network filtering and/or enable access to otherwise unreachable systems."
    },
    "T1218.002": {
        "name": "Control Panel",
        "description": "Adversaries may abuse control.exe to proxy execution of malicious payloads."
    },
    "T1599.001": {
        "name": "Network Address Translation Traversal",
        "description": "Adversaries may bridge network boundaries by modifying a network device’s Network Address Translation (NAT) configuration."
    },
    "T1608.002": {
        "name": "Upload Tool",
        "description": "Adversaries may upload tools to third-party or adversary controlled infrastructure to make it accessible during targeting."
    },
    "T1547.005": {
        "name": "Security Support Provider",
        "description": "Adversaries may abuse security support providers (SSPs) to execute DLLs when the system boots."
    },
    "T1036.011": {
        "name": "Overwrite Process Arguments",
        "description": "Adversaries may modify a process's in-memory arguments to change its name in order to appear as a legitimate or benign process."
    },
    "T1004": {
        "name": "Winlogon Helper DLL",
        "description": "Winlogon.exe is a Windows component responsible for actions at logon/logoff as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete."
    },
    "T1009": {
        "name": "Binary Padding",
        "description": "Adversaries can use binary padding to add junk data and change the on-disk representation of malware without affecting the functionality or behavior of the binary."
    },
    "T1550": {
        "name": "Use Alternate Authentication Material",
        "description": "Adversaries may use alternate authentication material, such as password hashes, Kerberos tickets, and application access tokens, in order to move laterally within an environment and bypass normal system access controls."
    },
    "T1076": {
        "name": "Remote Desktop Protocol",
        "description": "Remote desktop is a common feature in operating systems."
    },
    "T1597.001": {
        "name": "Threat Intel Vendors",
        "description": "Adversaries may search private data from threat intelligence vendors for information that can be used during targeting."
    },
    "T1011": {
        "name": "Exfiltration Over Other Network Medium",
        "description": "Adversaries may attempt to exfiltrate data over a different network medium than the command and control channel."
    },
    "T1602.002": {
        "name": "Network Device Configuration Dump",
        "description": "Adversaries may access network configuration files to collect sensitive data about the device and the network."
    },
    "T1589": {
        "name": "Gather Victim Identity Information",
        "description": "Adversaries may gather information about the victim's identity that can be used during targeting."
    },
    "T1131": {
        "name": "Authentication Package",
        "description": "Windows Authentication Package DLLs are loaded by the Local Security Authority (LSA) process at system start."
    },
    "T1181": {
        "name": "Extra Window Memory Injection",
        "description": "Before creating a window, graphical Windows-based processes must prescribe to or register a windows class, which stipulate appearance and behavior (via windows procedures, which are functions that handle input/output of data)."
    },
    "T1562.004": {
        "name": "Disable or Modify System Firewall",
        "description": "Adversaries may disable or modify system firewalls in order to bypass controls limiting network usage."
    },
    "T1560": {
        "name": "Archive Collected Data",
        "description": "An adversary may compress and/or encrypt data that is collected prior to exfiltration."
    },
    "T1152": {
        "name": "Launchctl",
        "description": "Launchctl controls the macOS launchd process which handles things like launch agents and launch daemons, but can execute other commands or programs itself."
    },
    "T1553.003": {
        "name": "SIP and Trust Provider Hijacking",
        "description": "Adversaries may tamper with SIP and trust provider components to mislead the operating system and application control tools when conducting signature validation checks."
    },
    "T1483": {
        "name": "Domain Generation Algorithms",
        "description": "Adversaries may make use of Domain Generation Algorithms (DGAs) to dynamically identify a destination for command and control traffic rather than relying on a list of static IP addresses or domains."
    },
    "T1185": {
        "name": "Browser Session Hijacking",
        "description": "Adversaries may take advantage of security vulnerabilities and inherent functionality in browser software to change content, modify user-behaviors, and intercept information as part of various browser session hijacking techniques.(Citation: Wikipedia Man in the Browser)\n\nA specific example is when an adversary injects software into a browser that allows them to inherit cookies, HTTP sessions, and SSL client certificates of a user then use the browser as a way to pivot into an authenticated intranet.(Citation: Cobalt Strike Browser Pivot)(Citation: ICEBRG Chrome Extensions) Executing browser-based behaviors such as pivoting may require specific process permissions, such as <code>SeDebugPrivilege</code> and/or high-integrity/administrator rights.\n\nAnother example involves pivoting browser traffic from the adversary's browser through the user's browser by setting up a proxy which will redirect web traffic."
    },
    "T1021": {
        "name": "Remote Services",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to log into a service that accepts remote connections, such as telnet, SSH, and VNC."
    },
    "T1071.003": {
        "name": "Mail Protocols",
        "description": "Adversaries may communicate using application layer protocols associated with electronic mail delivery to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1556.007": {
        "name": "Hybrid Identity",
        "description": "Adversaries may patch, modify, or otherwise backdoor cloud authentication processes that are tied to on-premises user identities in order to bypass typical authentication mechanisms, access credentials, and enable persistent access to accounts."
    },
    "T1595.002": {
        "name": "Vulnerability Scanning",
        "description": "Adversaries may scan victims for vulnerabilities that can be used during targeting."
    },
    "T1059.009": {
        "name": "Cloud API",
        "description": "Adversaries may abuse cloud APIs to execute malicious commands."
    },
    "T1596": {
        "name": "Search Open Technical Databases",
        "description": "Adversaries may search freely available technical databases for information about victims that can be used during targeting."
    },
    "T1218.015": {
        "name": "Electron Applications",
        "description": "Adversaries may abuse components of the Electron framework to execute malicious code."
    },
    "T1562.012": {
        "name": "Disable or Modify Linux Audit System",
        "description": "Adversaries may disable or modify the Linux audit system to hide malicious activity and avoid detection."
    },
    "T1207": {
        "name": "Rogue Domain Controller",
        "description": "Adversaries may register a rogue Domain Controller to enable manipulation of Active Directory data."
    },
    "T1553.006": {
        "name": "Code Signing Policy Modification",
        "description": "Adversaries may modify code signing policies to enable execution of unsigned or self-signed code."
    },
    "T1610": {
        "name": "Deploy Container",
        "description": "Adversaries may deploy a container into an environment to facilitate execution or evade defenses."
    },
    "T1107": {
        "name": "File Deletion",
        "description": "Adversaries may delete files left behind by the actions of their intrusion activity."
    },
    "T1145": {
        "name": "Private Keys",
        "description": "Private cryptographic keys and certificates are used for authentication, encryption/decryption, and digital signatures."
    },
    "T1112": {
        "name": "Modify Registry",
        "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\n\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access."
    },
    "T1543.004": {
        "name": "Launch Daemon",
        "description": "Adversaries may create or modify Launch Daemons to execute malicious payloads as part of persistence."
    },
    "T1580": {
        "name": "Cloud Infrastructure Discovery",
        "description": "An adversary may attempt to discover infrastructure and resources that are available within an infrastructure-as-a-service (IaaS) environment."
    },
    "T1555.003": {
        "name": "Credentials from Web Browsers",
        "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser.(Citation: Talos Olympic Destroyer 2018) Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future."
    },
    "T1574.008": {
        "name": "Path Interception by Search Order Hijacking",
        "description": "Adversaries may execute their own malicious payloads by hijacking the search order used to load other programs."
    },
    "T1491": {
        "name": "Defacement",
        "description": "Adversaries may modify visual content available internally or externally to an enterprise network, thus affecting the integrity of the original content."
    },
    "T1535": {
        "name": "Unused/Unsupported Cloud Regions",
        "description": "Adversaries may create cloud instances in unused geographic service regions in order to evade detection."
    },
    "T1557.003": {
        "name": "DHCP Spoofing",
        "description": "Adversaries may redirect network traffic to adversary-owned systems by spoofing Dynamic Host Configuration Protocol (DHCP) traffic and acting as a malicious DHCP server on the victim network."
    },
    "T1155": {
        "name": "AppleScript",
        "description": "macOS and OS X applications send AppleEvent messages to each other for interprocess communications (IPC)."
    },
    "T1563": {
        "name": "Remote Service Session Hijacking",
        "description": "Adversaries may take control of preexisting sessions with remote services to move laterally in an environment."
    },
    "T1564.013": {
        "name": "Bind Mounts",
        "description": "Adversaries may abuse bind mounts on file structures to hide their activity and artifacts from native utilities."
    },
    "T1027.001": {
        "name": "Binary Padding",
        "description": "Adversaries may use binary padding to add junk data and change the on-disk representation of malware."
    },
    "T1505.003": {
        "name": "Web Shell",
        "description": "Adversaries may backdoor web servers with web shells to establish persistent access to systems."
    },
    "T1484.001": {
        "name": "Group Policy Modification",
        "description": "Adversaries may modify Group Policy Objects (GPOs) to subvert the intended discretionary access controls for a domain, usually with the intention of escalating privileges on the domain."
    },
    "T1217": {
        "name": "Browser Information Discovery",
        "description": "Adversaries may enumerate information about browsers to learn more about compromised environments."
    },
    "T1552.004": {
        "name": "Private Keys",
        "description": "Adversaries may search for private key certificate files on compromised systems for insecurely stored credentials."
    },
    "T1583.004": {
        "name": "Server",
        "description": "Adversaries may buy, lease, rent, or obtain physical servers that can be used during targeting."
    },
    "T1021.006": {
        "name": "Windows Remote Management",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to interact with remote systems using Windows Remote Management (WinRM)."
    },
    "T1011.001": {
        "name": "Exfiltration Over Bluetooth",
        "description": "Adversaries may attempt to exfiltrate data over Bluetooth rather than the command and control channel."
    },
    "T1078.001": {
        "name": "Default Accounts",
        "description": "Adversaries may obtain and abuse credentials of a default account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion."
    },
    "T1547.003": {
        "name": "Time Providers",
        "description": "Adversaries may abuse time providers to execute DLLs when the system boots."
    },
    "T1183": {
        "name": "Image File Execution Options Injection",
        "description": "Image File Execution Options (IFEO) enable a developer to attach a debugger to an application."
    },
    "T1085": {
        "name": "Rundll32",
        "description": "The rundll32.exe program can be called to execute an arbitrary binary."
    },
    "T1031": {
        "name": "Modify Existing Service",
        "description": "Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Registry."
    },
    "T1546.005": {
        "name": "Trap",
        "description": "Adversaries may establish persistence by executing malicious content triggered by an interrupt signal."
    },
    "T1574.006": {
        "name": "Dynamic Linker Hijacking",
        "description": "Adversaries may execute their own malicious payloads by hijacking environment variables the dynamic linker uses to load shared libraries."
    },
    "T1136.001": {
        "name": "Local Account",
        "description": "Adversaries may create a local account to maintain access to victim systems."
    },
    "T1681": {
        "name": "Search Threat Vendor Data",
        "description": "Threat actors may seek information/indicators from closed or open threat intelligence sources gathered about their own campaigns, as well as those conducted by other adversaries that may align with their target industries, capabilities/objectives, or other operational concerns."
    },
    "T1674": {
        "name": "Input Injection",
        "description": "Adversaries may simulate keystrokes on a victim’s computer by various means to perform any type of action on behalf of the user, such as launching the command interpreter using keyboard shortcuts,  typing an inline script to be executed, or interacting directly with a GUI-based application."
    },
    "T1092": {
        "name": "Communication Through Removable Media",
        "description": "Adversaries can perform command and control between compromised hosts on potentially disconnected networks using removable media to transfer commands from system to system.(Citation: ESET Sednit USBStealer 2014) Both systems would need to be compromised, with the likelihood that an Internet-connected system was compromised first and the second through lateral movement by [Replication Through Removable Media](https://attack.mitre.org/techniques/T1091)."
    },
    "T1070.001": {
        "name": "Clear Windows Event Logs",
        "description": "Adversaries may clear Windows Event Logs to hide the activity of an intrusion."
    },
    "T1585.002": {
        "name": "Email Accounts",
        "description": "Adversaries may create email accounts that can be used during targeting."
    },
    "T1557.001": {
        "name": "LLMNR/NBT-NS Poisoning and SMB Relay",
        "description": "By responding to LLMNR/NBT-NS network traffic, adversaries may spoof an authoritative source for name resolution to force communication with an adversary controlled system."
    },
    "T1222": {
        "name": "File and Directory Permissions Modification",
        "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files.(Citation: Hybrid Analysis Icacls1 June 2018)(Citation: Hybrid Analysis Icacls2 May 2018) File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions."
    },
    "T1003.001": {
        "name": "LSASS Memory",
        "description": "Adversaries may attempt to access credential material stored in the process memory of the Local Security Authority Subsystem Service (LSASS)."
    },
    "T1053.001": {
        "name": "At (Linux)",
        "description": "Adversaries may abuse the [at](https://attack.mitre.org/software/S0110) utility to perform task scheduling for initial, recurring, or future execution of malicious code."
    },
    "T1176.002": {
        "name": "IDE Extensions",
        "description": "Adversaries may abuse an integrated development environment (IDE) extension to establish persistent access to victim systems.(Citation: Mnemonic misuse visual studio) IDEs such as Visual Studio Code, IntelliJ IDEA, and Eclipse support extensions - software components that add features like code linting, auto-completion, task automation, or integration with tools like Git and Docker."
    },
    "T1179": {
        "name": "Hooking",
        "description": "Windows processes often leverage application programming interface (API) functions to perform tasks that require reusable system resources."
    },
    "T1595": {
        "name": "Active Scanning",
        "description": "Adversaries may execute active reconnaissance scans to gather information that can be used during targeting."
    },
    "T1027.016": {
        "name": "Junk Code Insertion",
        "description": "Adversaries may use junk code / dead code to obfuscate a malware’s functionality."
    },
    "T1547.011": {
        "name": "Plist Modification",
        "description": "Adversaries can modify property list files (plist files) to execute their code as part of establishing persistence."
    },
    "T1548": {
        "name": "Abuse Elevation Control Mechanism",
        "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions."
    },
    "T1134.002": {
        "name": "Create Process with Token",
        "description": "Adversaries may create a new process with an existing token to escalate privileges and bypass access controls."
    },
    "T1548.001": {
        "name": "Setuid and Setgid",
        "description": "An adversary may abuse configurations where an application has the setuid or setgid bits set in order to get code running in a different (and possibly more privileged) user’s context."
    },
    "T1547.004": {
        "name": "Winlogon Helper DLL",
        "description": "Adversaries may abuse features of Winlogon to execute DLLs and/or executables when a user logs in."
    },
    "T1019": {
        "name": "System Firmware",
        "description": "The BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) or Extensible Firmware Interface (EFI) are examples of system firmware that operate as the software interface between the operating system and hardware of a computer."
    },
    "T1021.003": {
        "name": "Distributed Component Object Model",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to interact with remote machines by taking advantage of Distributed Component Object Model (DCOM)."
    },
    "T1042": {
        "name": "Change Default File Association",
        "description": "When a file is opened, the default program used to open the file (also called the file association or handler) is checked."
    },
    "T1117": {
        "name": "Regsvr32",
        "description": "Regsvr32.exe is a command-line program used to register and unregister object linking and embedding controls, including dynamic link libraries (DLLs), on Windows systems."
    },
    "T1110.003": {
        "name": "Password Spraying",
        "description": "Adversaries may use a single or small list of commonly used passwords against many different accounts to attempt to acquire valid account credentials."
    },
    "T1090.002": {
        "name": "External Proxy",
        "description": "Adversaries may use an external proxy to act as an intermediary for network communications to a command and control server to avoid direct connections to their infrastructure."
    },
    "T1056.003": {
        "name": "Web Portal Capture",
        "description": "Adversaries may install code on externally facing portals, such as a VPN login page, to capture and transmit credentials of users who attempt to log into the service."
    },
    "T1589.002": {
        "name": "Email Addresses",
        "description": "Adversaries may gather email addresses that can be used during targeting."
    },
    "T1164": {
        "name": "Re-opened Applications",
        "description": "Starting in Mac OS X 10.7 (Lion), users can specify certain applications to be re-opened when a user reboots their machine."
    },
    "T1054": {
        "name": "Indicator Blocking",
        "description": "An adversary may attempt to block indicators or events typically captured by sensors from being gathered and analyzed."
    },
    "T1598.004": {
        "name": "Spearphishing Voice",
        "description": "Adversaries may use voice communications to elicit sensitive information that can be used during targeting."
    },
    "T1108": {
        "name": "Redundant Access",
        "description": "**This technique has been deprecated."
    },
    "T1193": {
        "name": "Spearphishing Attachment",
        "description": "Spearphishing attachment is a specific variant of spearphishing."
    },
    "T1003.005": {
        "name": "Cached Domain Credentials",
        "description": "Adversaries may attempt to access cached domain credentials used to allow authentication to occur in the event a domain controller is unavailable.(Citation: Microsoft - Cached Creds)\n\nOn Windows Vista and newer, the hash format is DCC2 (Domain Cached Credentials version 2) hash, also known as MS-Cache v2 hash.(Citation: PassLib mscache) The number of default cached credentials varies and can be altered per system."
    },
    "T1098.004": {
        "name": "SSH Authorized Keys",
        "description": "Adversaries may modify the SSH <code>authorized_keys</code> file to maintain persistence on a victim host."
    },
    "T1673": {
        "name": "Virtual Machine Discovery",
        "description": "An adversary may attempt to enumerate running virtual machines (VMs) after gaining access to a host or hypervisor."
    },
    "T1215": {
        "name": "Kernel Modules and Extensions",
        "description": "Loadable Kernel Modules (or LKMs) are pieces of code that can be loaded and unloaded into the kernel upon demand."
    },
    "T1101": {
        "name": "Security Support Provider",
        "description": "Windows Security Support Provider (SSP) DLLs are loaded into the Local Security Authority (LSA) process at system start."
    },
    "T1590.006": {
        "name": "Network Security Appliances",
        "description": "Adversaries may gather information about the victim's network security appliances that can be used during targeting."
    },
    "T1546.012": {
        "name": "Image File Execution Options Injection",
        "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by Image File Execution Options (IFEO) debuggers."
    },
    "T1218.008": {
        "name": "Odbcconf",
        "description": "Adversaries may abuse odbcconf.exe to proxy execution of malicious payloads."
    },
    "T1593.002": {
        "name": "Search Engines",
        "description": "Adversaries may use search engines to collect information about victims that can be used during targeting."
    },
    "T1177": {
        "name": "LSASS Driver",
        "description": "The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain."
    },
    "T1591.002": {
        "name": "Business Relationships",
        "description": "Adversaries may gather information about the victim's business relationships that can be used during targeting."
    },
    "T1548.005": {
        "name": "Temporary Elevated Cloud Access",
        "description": "Adversaries may abuse permission configurations that allow them to gain temporarily elevated access to cloud resources."
    },
    "T1125": {
        "name": "Video Capture",
        "description": "An adversary can leverage a computer's peripheral devices (e.g., integrated cameras or webcams) or applications (e.g., video call services) to capture video recordings for the purpose of gathering information."
    },
    "T1144": {
        "name": "Gatekeeper Bypass",
        "description": "In macOS and OS X, when applications or programs are downloaded from the internet, there is a special attribute set on the file called <code>com.apple.quarantine</code>."
    },
    "T1045": {
        "name": "Software Packing",
        "description": "Software packing is a method of compressing or encrypting an executable."
    },
    "T1055.013": {
        "name": "Process Doppelgänging",
        "description": "Adversaries may inject malicious code into process via process doppelgänging in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1016": {
        "name": "System Network Configuration Discovery",
        "description": "Adversaries may look for details about the network configuration and settings, such as IP and/or MAC addresses, of systems they access or through information discovery of remote systems."
    },
    "T1578.003": {
        "name": "Delete Cloud Instance",
        "description": "An adversary may delete a cloud instance after they have performed malicious activities in an attempt to evade detection and remove evidence of their presence."
    },
    "T1593.003": {
        "name": "Code Repositories",
        "description": "Adversaries may search public code repositories for information about victims that can be used during targeting."
    },
    "T1574.005": {
        "name": "Executable Installer File Permissions Weakness",
        "description": "Adversaries may execute their own malicious payloads by hijacking the binaries used by an installer."
    },
    "T1546.008": {
        "name": "Accessibility Features",
        "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by accessibility features."
    },
    "T1496.002": {
        "name": "Bandwidth Hijacking",
        "description": "Adversaries may leverage the network bandwidth resources of co-opted systems to complete resource-intensive tasks, which may impact system and/or hosted service availability."
    },
    "T1504": {
        "name": "PowerShell Profile",
        "description": "Adversaries may gain persistence and elevate privileges in certain situations by abusing [PowerShell](https://attack.mitre.org/techniques/T1086) profiles."
    },
    "T1198": {
        "name": "SIP and Trust Provider Hijacking",
        "description": "In user mode, Windows Authenticode (Citation: Microsoft Authenticode) digital signatures are used to verify a file's origin and integrity, variables that may be used to establish trust in signed code (ex: a driver with a valid Microsoft signature may be handled as safe)."
    },
    "T1087": {
        "name": "Account Discovery",
        "description": "Adversaries may attempt to get a listing of valid accounts, usernames, or email addresses on a system or within a compromised environment."
    },
    "T1090": {
        "name": "Proxy",
        "description": "Adversaries may use a connection proxy to direct network traffic between systems or act as an intermediary for network communications to a command and control server to avoid direct connections to their infrastructure."
    },
    "T1059": {
        "name": "Command and Scripting Interpreter",
        "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries."
    },
    "T1204.005": {
        "name": "Malicious Library",
        "description": "Adversaries may rely on a user installing a malicious library to facilitate execution."
    },
    "T1562.006": {
        "name": "Indicator Blocking",
        "description": "An adversary may attempt to block indicators or events typically captured by sensors from being gathered and analyzed."
    },
    "T1136.002": {
        "name": "Domain Account",
        "description": "Adversaries may create a domain account to maintain access to victim systems."
    },
    "T1564.014": {
        "name": "Extended Attributes",
        "description": "Adversaries may abuse extended attributes (xattrs) on macOS and Linux to hide their malicious data in order to evade detection."
    },
    "T1589.003": {
        "name": "Employee Names",
        "description": "Adversaries may gather employee names that can be used during targeting."
    },
    "T1677": {
        "name": "Poisoned Pipeline Execution",
        "description": "Adversaries may manipulate continuous integration / continuous development (CI/CD) processes by injecting malicious code into the build process."
    },
    "T1482": {
        "name": "Domain Trust Discovery",
        "description": "Adversaries may attempt to gather information on domain trust relationships that may be used to identify lateral movement opportunities in Windows multi-domain/forest environments."
    },
    "T1558.001": {
        "name": "Golden Ticket",
        "description": "Adversaries who have the KRBTGT account password hash may forge Kerberos ticket-granting tickets (TGT), also known as a golden ticket.(Citation: AdSecurity Kerberos GT Aug 2015) Golden tickets enable adversaries to generate authentication material for any account in Active Directory.(Citation: CERT-EU Golden Ticket Protection) \n\nUsing a golden ticket, adversaries are then able to request ticket granting service (TGS) tickets, which enable access to specific resources."
    },
    "T1175": {
        "name": "Component Object Model and Distributed COM",
        "description": "**This technique has been deprecated."
    },
    "T1020": {
        "name": "Automated Exfiltration",
        "description": "Adversaries may exfiltrate data, such as sensitive documents, through the use of automated processing after being gathered during Collection.(Citation: ESET Gamaredon June 2020) \n\nWhen automated exfiltration is used, other exfiltration techniques likely apply as well to transfer the information out of the network, such as [Exfiltration Over C2 Channel](https://attack.mitre.org/techniques/T1041) and [Exfiltration Over Alternative Protocol](https://attack.mitre.org/techniques/T1048).."
    },
    "T1592.004": {
        "name": "Client Configurations",
        "description": "Adversaries may gather information about the victim's client configurations that can be used during targeting."
    },
    "T1562.007": {
        "name": "Disable or Modify Cloud Firewall",
        "description": "Adversaries may disable or modify a firewall within a cloud environment to bypass controls that limit access to cloud resources."
    },
    "T1219.001": {
        "name": "IDE Tunneling",
        "description": "Adversaries may abuse Integrated Development Environment (IDE) software with remote development features to establish an interactive command and control channel on target systems within a network."
    },
    "T1036.002": {
        "name": "Right-to-Left Override",
        "description": "Adversaries may abuse the right-to-left override (RTLO or RLO) character (U+202E) to disguise a string and/or file name to make it appear benign."
    },
    "T1588.001": {
        "name": "Malware",
        "description": "Adversaries may buy, steal, or download malware that can be used during targeting."
    },
    "T1027.017": {
        "name": "SVG Smuggling",
        "description": "Adversaries may smuggle data and files past content filters by hiding malicious payloads inside of seemingly benign SVG files.(Citation: Trustwave SVG Smuggling 2025) SVGs, or Scalable Vector Graphics, are vector-based image files constructed using XML."
    },
    "T1542.002": {
        "name": "Component Firmware",
        "description": "Adversaries may modify component firmware to persist on systems."
    },
    "T1070": {
        "name": "Indicator Removal",
        "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses."
    },
    "T1048.001": {
        "name": "Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
        "description": "Adversaries may steal data by exfiltrating it over a symmetrically encrypted network protocol other than that of the existing command and control channel."
    },
    "T1137.001": {
        "name": "Office Template Macros",
        "description": "Adversaries may abuse Microsoft Office templates to obtain persistence on a compromised system."
    },
    "T1583.003": {
        "name": "Virtual Private Server",
        "description": "Adversaries may rent Virtual Private Servers (VPSs) that can be used during targeting."
    },
    "T1213.001": {
        "name": "Confluence",
        "description": "\nAdversaries may leverage Confluence repositories to mine valuable information."
    },
    "T1550.003": {
        "name": "Pass the Ticket",
        "description": "Adversaries may “pass the ticket” using stolen Kerberos tickets to move laterally within an environment, bypassing normal system access controls."
    },
    "T1609": {
        "name": "Container Administration Command",
        "description": "Adversaries may abuse a container administration service to execute commands within a container."
    },
    "T1083": {
        "name": "File and Directory Discovery",
        "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system."
    },
    "T1568": {
        "name": "Dynamic Resolution",
        "description": "Adversaries may dynamically establish connections to command and control infrastructure to evade common detections and remediations."
    },
    "T1036.004": {
        "name": "Masquerade Task or Service",
        "description": "Adversaries may attempt to manipulate the name of a task or service to make it appear legitimate or benign."
    },
    "T1055.004": {
        "name": "Asynchronous Procedure Call",
        "description": "Adversaries may inject malicious code into processes via the asynchronous procedure call (APC) queue in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1020.001": {
        "name": "Traffic Duplication",
        "description": "Adversaries may leverage traffic mirroring in order to automate data exfiltration over compromised infrastructure."
    },
    "T1138": {
        "name": "Application Shimming",
        "description": "The Microsoft Windows Application Compatibility Infrastructure/Framework (Application Shim) was created to allow for backward compatibility of software as the operating system codebase changes over time."
    },
    "T1647": {
        "name": "Plist File Modification",
        "description": "Adversaries may modify property list files (plist files) to enable other malicious activity, while also potentially evading and bypassing system defenses."
    },
    "T1127.003": {
        "name": "JamPlus",
        "description": "Adversaries may use `JamPlus` to proxy the execution of a malicious script."
    },
    "T1546.009": {
        "name": "AppCert DLLs",
        "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by AppCert DLLs loaded into processes."
    },
    "T1191": {
        "name": "CMSTP",
        "description": "The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a command-line program used to install Connection Manager service profiles."
    },
    "T1188": {
        "name": "Multi-hop Proxy",
        "description": "To disguise the source of malicious traffic, adversaries may chain together multiple proxies."
    },
    "T1114.003": {
        "name": "Email Forwarding Rule",
        "description": "Adversaries may setup email forwarding rules to collect sensitive information."
    },
    "T1074": {
        "name": "Data Staged",
        "description": "Adversaries may stage collected data in a central location or directory prior to Exfiltration."
    },
    "T1649": {
        "name": "Steal or Forge Authentication Certificates",
        "description": "Adversaries may steal or forge certificates used for authentication to access remote systems or resources."
    },
    "T1098.005": {
        "name": "Device Registration",
        "description": "Adversaries may register a device to an adversary-controlled account."
    },
    "T1049": {
        "name": "System Network Connections Discovery",
        "description": "Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network."
    },
    "T1584": {
        "name": "Compromise Infrastructure",
        "description": "Adversaries may compromise third-party infrastructure that can be used during targeting."
    },
    "T1553.005": {
        "name": "Mark-of-the-Web Bypass",
        "description": "Adversaries may abuse specific file formats to subvert Mark-of-the-Web (MOTW) controls."
    },
    "T1600.002": {
        "name": "Disable Crypto Hardware",
        "description": "Adversaries disable a network device’s dedicated hardware encryption, which may enable them to leverage weaknesses in software encryption in order to reduce the effort involved in collecting, manipulating, and exfiltrating transmitted data.\n\nMany network devices such as routers, switches, and firewalls, perform encryption on network traffic to secure transmission across networks."
    },
    "T1542": {
        "name": "Pre-OS Boot",
        "description": "Adversaries may abuse Pre-OS Boot mechanisms as a way to establish persistence on a system."
    },
    "T1064": {
        "name": "Scripting",
        "description": "**This technique has been deprecated."
    },
    "T1612": {
        "name": "Build Image on Host",
        "description": "Adversaries may build a container image directly on a host to bypass defenses that monitor for the retrieval of malicious images from a public registry."
    },
    "T1051": {
        "name": "Shared Webroot",
        "description": "**This technique has been deprecated and should no longer be used.**\n\nAdversaries may add malicious content to an internally accessible website through an open network file share that contains the website's webroot or Web content directory (Citation: Microsoft Web Root OCT 2016) (Citation: Apache Server 2018) and then browse to that content with a Web browser to cause the server to execute the malicious content."
    },
    "T1055.002": {
        "name": "Portable Executable Injection",
        "description": "Adversaries may inject portable executables (PE) into processes in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1218.012": {
        "name": "Verclsid",
        "description": "Adversaries may abuse verclsid.exe to proxy execution of malicious code."
    },
    "T1586": {
        "name": "Compromise Accounts",
        "description": "Adversaries may compromise accounts with services that can be used during targeting."
    },
    "T1569.001": {
        "name": "Launchctl",
        "description": "Adversaries may abuse launchctl to execute commands or programs."
    },
    "T1584.005": {
        "name": "Botnet",
        "description": "Adversaries may compromise numerous third-party systems to form a botnet that can be used during targeting."
    },
    "T1059.008": {
        "name": "Network Device CLI",
        "description": "Adversaries may abuse scripting or built-in command line interpreters (CLI) on network devices to execute malicious command and payloads."
    },
    "T1552.003": {
        "name": "Shell History",
        "description": "Adversaries may search the command history on compromised systems for insecurely stored credentials.\n\nOn Linux and macOS systems, shells such as Bash and Zsh keep track of the commands users type on the command-line with the \"history\" utility."
    },
    "T1562.010": {
        "name": "Downgrade Attack",
        "description": "Adversaries may downgrade or use a version of system features that may be outdated, vulnerable, and/or does not support updated security controls."
    },
    "T1559.003": {
        "name": "XPC Services",
        "description": "Adversaries can provide malicious content to an XPC service daemon for local code execution."
    },
    "T1497": {
        "name": "Virtualization/Sandbox Evasion",
        "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments."
    },
    "T1102": {
        "name": "Web Service",
        "description": "Adversaries may use an existing, legitimate external Web service as a means for relaying data to/from a compromised system."
    },
    "T1552.001": {
        "name": "Credentials In Files",
        "description": "Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials."
    },
    "T1568.003": {
        "name": "DNS Calculation",
        "description": "Adversaries may perform calculations on addresses returned in DNS results to determine which port and IP address to use for command and control, rather than relying on a predetermined port number or the actual returned IP address."
    },
    "T1218.005": {
        "name": "Mshta",
        "description": "Adversaries may abuse mshta.exe to proxy execution of malicious .hta files and Javascript or VBScript through a trusted Windows utility."
    },
    "T1547.015": {
        "name": "Login Items",
        "description": "Adversaries may add login items to execute upon user login to gain persistence or escalate privileges."
    },
    "T1608": {
        "name": "Stage Capabilities",
        "description": "Adversaries may upload, install, or otherwise set up capabilities that can be used during targeting."
    },
    "T1608.005": {
        "name": "Link Target",
        "description": "Adversaries may put in place resources that are referenced by a link that can be used during targeting."
    },
    "T1104": {
        "name": "Multi-Stage Channels",
        "description": "Adversaries may create multiple stages for command and control that are employed under different conditions or for certain functions."
    },
    "T1657": {
        "name": "Financial Theft",
        "description": "Adversaries may steal monetary resources from targets through extortion, social engineering, technical theft, or other methods aimed at their own financial gain at the expense of the availability of these resources for victims."
    },
    "T1480": {
        "name": "Execution Guardrails",
        "description": "Adversaries may use execution guardrails to constrain execution or actions based on adversary supplied and environment specific conditions that are expected to be present on the target."
    },
    "T1619": {
        "name": "Cloud Storage Object Discovery",
        "description": "Adversaries may enumerate objects in cloud storage infrastructure."
    },
    "T1606.001": {
        "name": "Web Cookies",
        "description": "Adversaries may forge web cookies that can be used to gain access to web applications or Internet services."
    },
    "T1654": {
        "name": "Log Enumeration",
        "description": "Adversaries may enumerate system and service logs to find useful data."
    },
    "T1134.001": {
        "name": "Token Impersonation/Theft",
        "description": "Adversaries may duplicate then impersonate another user's existing token to escalate privileges and bypass access controls."
    },
    "T1567.001": {
        "name": "Exfiltration to Code Repository",
        "description": "Adversaries may exfiltrate data to a code repository rather than over their primary command and control channel."
    },
    "T1021.007": {
        "name": "Cloud Services",
        "description": "Adversaries may log into accessible cloud services within a compromised environment using [Valid Accounts](https://attack.mitre.org/techniques/T1078) that are synchronized with or federated to on-premises user identities."
    },
    "T1205.001": {
        "name": "Port Knocking",
        "description": "Adversaries may use port knocking to hide open ports used for persistence or command and control."
    },
    "T1027.012": {
        "name": "LNK Icon Smuggling",
        "description": "Adversaries may smuggle commands to download malicious payloads past content filters by hiding them within otherwise seemingly benign windows shortcut files."
    },
    "T1583.006": {
        "name": "Web Services",
        "description": "Adversaries may register for web services that can be used during targeting."
    },
    "T1528": {
        "name": "Steal Application Access Token",
        "description": "Adversaries can steal application access tokens as a means of acquiring credentials to access remote systems and resources.\n\nApplication access tokens are used to make authorized API requests on behalf of a user or service and are commonly used as a way to access resources in cloud and container-based applications and software-as-a-service (SaaS).(Citation: Auth0 - Why You Should Always Use Access Tokens to Secure APIs Sept 2019)  Adversaries who steal account API tokens in cloud and containerized environments may be able to access data and perform actions with the permissions of these accounts, which can lead to privilege escalation and further compromise of the environment.\n\nFor example, in Kubernetes environments, processes running inside a container may communicate with the Kubernetes API server using service account tokens."
    },
    "T1598.002": {
        "name": "Spearphishing Attachment",
        "description": "Adversaries may send spearphishing messages with a malicious attachment to elicit sensitive information that can be used during targeting."
    },
    "T1098.001": {
        "name": "Additional Cloud Credentials",
        "description": "Adversaries may add adversary-controlled credentials to a cloud account to maintain persistent access to victim accounts and instances within the environment.\n\nFor example, adversaries may add credentials for Service Principals and Applications in addition to existing legitimate credentials in Azure / Entra ID.(Citation: Microsoft SolarWinds Customer Guidance)(Citation: Blue Cloud of Death)(Citation: Blue Cloud of Death Video) These credentials include both x509 keys and passwords.(Citation: Microsoft SolarWinds Customer Guidance) With sufficient permissions, there are a variety of ways to add credentials including the Azure Portal, Azure command line interface, and Azure or Az PowerShell modules.(Citation: Demystifying Azure AD Service Principals)\n\nIn infrastructure-as-a-service (IaaS) environments, after gaining access through [Cloud Accounts](https://attack.mitre.org/techniques/T1078/004), adversaries may generate or import their own SSH keys using either the <code>CreateKeyPair</code> or <code>ImportKeyPair</code> API in AWS or the <code>gcloud compute os-login ssh-keys add</code> command in GCP.(Citation: GCP SSH Key Add) This allows persistent access to instances within the cloud environment without further usage of the compromised cloud accounts.(Citation: Expel IO Evil in AWS)(Citation: Expel Behind the Scenes)\n\nAdversaries may also use the <code>CreateAccessKey</code> API in AWS or the <code>gcloud iam service-accounts keys create</code> command in GCP to add access keys to an account."
    },
    "T1204": {
        "name": "User Execution",
        "description": "An adversary may rely upon specific actions by a user in order to gain execution."
    },
    "T1491.001": {
        "name": "Internal Defacement",
        "description": "An adversary may deface systems internal to an organization in an attempt to intimidate or mislead users, thus discrediting the integrity of the systems."
    },
    "T1564.002": {
        "name": "Hidden Users",
        "description": "Adversaries may use hidden users to hide the presence of user accounts they create or modify."
    },
    "T1134.003": {
        "name": "Make and Impersonate Token",
        "description": "Adversaries may make new tokens and impersonate users to escalate privileges and bypass access controls."
    },
    "T1552.006": {
        "name": "Group Policy Preferences",
        "description": "Adversaries may attempt to find unsecured credentials in Group Policy Preferences (GPP)."
    },
    "T1196": {
        "name": "Control Panel Items",
        "description": "Windows Control Panel items are utilities that allow users to view and adjust computer settings."
    },
    "T1048.002": {
        "name": "Exfiltration Over Asymmetric Encrypted Non-C2 Protocol",
        "description": "Adversaries may steal data by exfiltrating it over an asymmetrically encrypted network protocol other than that of the existing command and control channel."
    },
    "T1087.004": {
        "name": "Cloud Account",
        "description": "Adversaries may attempt to get a listing of cloud accounts."
    },
    "T1057": {
        "name": "Process Discovery",
        "description": "Adversaries may attempt to get information about running processes on a system."
    },
    "T1562.003": {
        "name": "Impair Command History Logging",
        "description": "Adversaries may impair command history logging to hide commands they run on a compromised system."
    },
    "T1053.004": {
        "name": "Launchd",
        "description": "This technique is deprecated due to the inaccurate usage."
    },
    "T1556.008": {
        "name": "Network Provider DLL",
        "description": "Adversaries may register malicious network provider dynamic link libraries (DLLs) to capture cleartext user credentials during the authentication process."
    },
    "T1546.003": {
        "name": "Windows Management Instrumentation Event Subscription",
        "description": "Adversaries may establish persistence and elevate privileges by executing malicious content triggered by a Windows Management Instrumentation (WMI) event subscription."
    },
    "T1596.004": {
        "name": "CDNs",
        "description": "Adversaries may search content delivery network (CDN) data about victims that can be used during targeting."
    },
    "T1497.002": {
        "name": "User Activity Based Checks",
        "description": "Adversaries may employ various user activity checks to detect and avoid virtualization and analysis environments."
    },
    "T1141": {
        "name": "Input Prompt",
        "description": "When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: [Bypass User Account Control](https://attack.mitre.org/techniques/T1088)).\n\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite.(Citation: OSX Malware Exploits MacKeeper) This type of prompt can be used to collect credentials via various languages such as [AppleScript](https://attack.mitre.org/techniques/T1155)(Citation: LogRhythm Do You Trust Oct 2014)(Citation: OSX Keydnap malware) and [PowerShell](https://attack.mitre.org/techniques/T1086)(Citation: LogRhythm Do You Trust Oct 2014)(Citation: Enigma Phishing for Credentials Jan 2015).."
    },
    "T1496.004": {
        "name": "Cloud Service Hijacking",
        "description": "Adversaries may leverage compromised software-as-a-service (SaaS) applications to complete resource-intensive tasks, which may impact hosted service availability."
    },
    "T1585.003": {
        "name": "Cloud Accounts",
        "description": "Adversaries may create accounts with cloud providers that can be used during targeting."
    },
    "T1072": {
        "name": "Software Deployment Tools",
        "description": "Adversaries may gain access to and use centralized software suites installed within an enterprise to execute commands and move laterally through the network."
    },
    "T1041": {
        "name": "Exfiltration Over C2 Channel",
        "description": "Adversaries may steal data by exfiltrating it over an existing command and control channel."
    },
    "T1134.004": {
        "name": "Parent PID Spoofing",
        "description": "Adversaries may spoof the parent process identifier (PPID) of a new process to evade process-monitoring defenses or to elevate privileges."
    },
    "T1591": {
        "name": "Gather Victim Org Information",
        "description": "Adversaries may gather information about the victim's organization that can be used during targeting."
    },
    "T1060": {
        "name": "Registry Run Keys / Startup Folder",
        "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key."
    },
    "T1606": {
        "name": "Forge Web Credentials",
        "description": "Adversaries may forge credential materials that can be used to gain access to web applications or Internet services."
    },
    "T1621": {
        "name": "Multi-Factor Authentication Request Generation",
        "description": "Adversaries may attempt to bypass multi-factor authentication (MFA) mechanisms and gain access to accounts by generating MFA requests sent to users.\n\nAdversaries in possession of credentials to [Valid Accounts](https://attack.mitre.org/techniques/T1078) may be unable to complete the login process if they lack access to the 2FA or MFA mechanisms required as an additional credential and security control."
    },
    "T1554": {
        "name": "Compromise Host Software Binary",
        "description": "Adversaries may modify host software binaries to establish persistent access to systems."
    },
    "T1552.008": {
        "name": "Chat Messages",
        "description": "Adversaries may directly collect unsecured credentials stored or passed through user communication services."
    },
    "T1059.001": {
        "name": "PowerShell",
        "description": "Adversaries may abuse PowerShell commands and scripts for execution."
    },
    "T1023": {
        "name": "Shortcut Modification",
        "description": "Shortcuts or symbolic links are ways of referencing other files or programs that will be opened or executed when the shortcut is clicked or executed by a system startup process."
    },
    "T1546.001": {
        "name": "Change Default File Association",
        "description": "Adversaries may establish persistence by executing malicious content triggered by a file type association."
    },
    "T1055.014": {
        "name": "VDSO Hijacking",
        "description": "Adversaries may inject malicious code into processes via VDSO hijacking in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1026": {
        "name": "Multiband Communication",
        "description": "**This technique has been deprecated and should no longer be used.**\n\nSome adversaries may split communications between different protocols."
    },
    "T1071.002": {
        "name": "File Transfer Protocols",
        "description": "Adversaries may communicate using application layer protocols associated with transferring files to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1679": {
        "name": "Selective Exclusion",
        "description": "Adversaries may intentionally exclude certain files, folders, directories, file types, or system components from encryption or tampering during a ransomware or malicious payload execution."
    },
    "T1122": {
        "name": "Component Object Model Hijacking",
        "description": "The Component Object Model (COM) is a system within Windows to enable interaction between software components through the operating system."
    },
    "T1015": {
        "name": "Accessibility Features",
        "description": "Windows contains accessibility features that may be launched with a key combination before a user has logged in (for example, when the user is on the Windows logon screen)."
    },
    "T1212": {
        "name": "Exploitation for Credential Access",
        "description": "Adversaries may exploit software vulnerabilities in an attempt to collect credentials."
    },
    "T1546.014": {
        "name": "Emond",
        "description": "Adversaries may gain persistence and elevate privileges by executing malicious content triggered by the Event Monitor Daemon (emond)."
    },
    "T1102.003": {
        "name": "One-Way Communication",
        "description": "Adversaries may use an existing, legitimate external Web service as a means for sending commands to a compromised system without receiving return output over the Web service channel."
    },
    "T1590": {
        "name": "Gather Victim Network Information",
        "description": "Adversaries may gather information about the victim's networks that can be used during targeting."
    },
    "T1210": {
        "name": "Exploitation of Remote Services",
        "description": "Adversaries may exploit remote services to gain unauthorized access to internal systems once inside of a network."
    },
    "T1502": {
        "name": "Parent PID Spoofing",
        "description": "Adversaries may spoof the parent process identifier (PPID) of a new process to evade process-monitoring defenses or to elevate privileges."
    },
    "T1142": {
        "name": "Keychain",
        "description": "Keychains are the built-in way for macOS to keep track of users' passwords and credentials for many services and features such as WiFi passwords, websites, secure notes, certificates, and Kerberos."
    },
    "T1534": {
        "name": "Internal Spearphishing",
        "description": "After they already have access to accounts or systems within the environment, adversaries may use internal spearphishing to gain access to additional information or compromise other users within the same organization."
    },
    "T1169": {
        "name": "Sudo",
        "description": "The sudoers file, <code>/etc/sudoers</code>, describes which users can run which commands and from which terminals."
    },
    "T1574.010": {
        "name": "Services File Permissions Weakness",
        "description": "Adversaries may execute their own malicious payloads by hijacking the binaries used by services."
    },
    "T1547.001": {
        "name": "Registry Run Keys / Startup Folder",
        "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key."
    },
    "T1199": {
        "name": "Trusted Relationship",
        "description": "Adversaries may breach or otherwise leverage organizations who have access to intended victims."
    },
    "T1136.003": {
        "name": "Cloud Account",
        "description": "Adversaries may create a cloud account to maintain access to victim systems."
    },
    "T1069.001": {
        "name": "Local Groups",
        "description": "Adversaries may attempt to find local system groups and permission settings."
    },
    "T1149": {
        "name": "LC_MAIN Hijacking",
        "description": "**This technique has been deprecated and should no longer be used.**\n\nAs of OS X 10.8, mach-O binaries introduced a new header called LC_MAIN that points to the binary’s entry point for execution."
    },
    "T1593": {
        "name": "Search Open Websites/Domains",
        "description": "Adversaries may search freely available websites and/or domains for information about victims that can be used during targeting."
    },
    "T1562.013": {
        "name": "Disable or Modify Network Device Firewall",
        "description": "Adversaries may disable network device-based firewall mechanisms entirely or add, delete, or modify particular rules in order to bypass controls limiting network usage."
    },
    "T1098": {
        "name": "Account Manipulation",
        "description": "Adversaries may manipulate accounts to maintain and/or elevate access to victim systems."
    },
    "T1170": {
        "name": "Mshta",
        "description": "Mshta.exe is a utility that executes Microsoft HTML Applications (HTA)."
    },
    "T1048": {
        "name": "Exfiltration Over Alternative Protocol",
        "description": "Adversaries may steal data by exfiltrating it over a different protocol than that of the existing command and control channel."
    },
    "T1547.006": {
        "name": "Kernel Modules and Extensions",
        "description": "Adversaries may modify the kernel to automatically execute programs on system boot."
    },
    "T1678": {
        "name": "Delay Execution",
        "description": "Adversaries may employ various time-based methods to evade detection and analysis."
    },
    "T1056.002": {
        "name": "GUI Input Capture",
        "description": "Adversaries may mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt."
    },
    "T1097": {
        "name": "Pass the Ticket",
        "description": "Pass the ticket (PtT) is a method of authenticating to a system using Kerberos tickets without having access to an account's password."
    },
    "T1588.002": {
        "name": "Tool",
        "description": "Adversaries may buy, steal, or download software tools that can be used during targeting."
    },
    "T1052.001": {
        "name": "Exfiltration over USB",
        "description": "Adversaries may attempt to exfiltrate data over a USB connected physical device."
    },
    "T1574.013": {
        "name": "KernelCallbackTable",
        "description": "Adversaries may abuse the <code>KernelCallbackTable</code> of a process to hijack its execution flow in order to run their own payloads.(Citation: Lazarus APT January 2022)(Citation: FinFisher exposed ) The <code>KernelCallbackTable</code> can be found in the Process Environment Block (PEB) and is initialized to an array of graphic functions available to a GUI process once <code>user32.dll</code> is loaded.(Citation: Windows Process Injection KernelCallbackTable)\n\nAn adversary may hijack the execution flow of a process using the <code>KernelCallbackTable</code> by replacing an original callback function with a malicious payload."
    },
    "T1597": {
        "name": "Search Closed Sources",
        "description": "Adversaries may search and gather information about victims from closed (e.g., paid, private, or otherwise not freely available) sources that can be used during targeting."
    },
    "T1053.006": {
        "name": "Systemd Timers",
        "description": "Adversaries may abuse systemd timers to perform task scheduling for initial or recurring execution of malicious code."
    },
    "T1566": {
        "name": "Phishing",
        "description": "Adversaries may send phishing messages to gain access to victim systems."
    },
    "T1061": {
        "name": "Graphical User Interface",
        "description": "**This technique has been deprecated."
    },
    "T1542.004": {
        "name": "ROMMONkit",
        "description": "Adversaries may abuse the ROM Monitor (ROMMON) by loading an unauthorized firmware with adversary code to provide persistent access and manipulate device behavior that is difficult to detect."
    },
    "T1218.001": {
        "name": "Compiled HTML File",
        "description": "Adversaries may abuse Compiled HTML files (.chm) to conceal malicious code."
    },
    "T1496.001": {
        "name": "Compute Hijacking",
        "description": "Adversaries may leverage the compute resources of co-opted systems to complete resource-intensive tasks, which may impact system and/or hosted service availability."
    },
    "T1070.005": {
        "name": "Network Share Connection Removal",
        "description": "Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation."
    },
    "T1090.003": {
        "name": "Multi-hop Proxy",
        "description": "Adversaries may chain together multiple proxies to disguise the source of malicious traffic."
    },
    "T1110": {
        "name": "Brute Force",
        "description": "Adversaries may use brute force techniques to gain access to accounts when passwords are unknown or when password hashes are obtained.(Citation: TrendMicro Pawn Storm Dec 2020) Without knowledge of the password for an account or set of accounts, an adversary may systematically guess the password using a repetitive or iterative mechanism.(Citation: Dragos Crashoverride 2018) Brute forcing passwords can take place via interaction with a service that will check the validity of those credentials or offline against previously acquired credential data, such as password hashes.\n\nBrute forcing credentials may take place at various points during a breach."
    },
    "T1059.004": {
        "name": "Unix Shell",
        "description": "Adversaries may abuse Unix shell commands and scripts for execution."
    },
    "T1137.003": {
        "name": "Outlook Forms",
        "description": "Adversaries may abuse Microsoft Outlook forms to obtain persistence on a compromised system."
    },
    "T1219.003": {
        "name": "Remote Access Hardware",
        "description": "An adversary may use legitimate remote access hardware to establish an interactive command and control channel to target systems within networks."
    },
    "T1157": {
        "name": "Dylib Hijacking",
        "description": "macOS and OS X use a common method to look for required dynamic libraries (dylib) to load into a program based on search paths."
    },
    "T1562.001": {
        "name": "Disable or Modify Tools",
        "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities."
    },
    "T1565": {
        "name": "Data Manipulation",
        "description": "Adversaries may insert, delete, or manipulate data in order to influence external outcomes or hide activity, thus threatening the integrity of the data.(Citation: Sygnia Elephant Beetle Jan 2022) By manipulating data, adversaries may attempt to affect a business process, organizational understanding, or decision making.\n\nThe type of modification and the impact it will have depends on the target application and process as well as the goals and objectives of the adversary."
    },
    "T1559": {
        "name": "Inter-Process Communication",
        "description": "Adversaries may abuse inter-process communication (IPC) mechanisms for local code or command execution."
    },
    "T1001": {
        "name": "Data Obfuscation",
        "description": "Adversaries may obfuscate command and control traffic to make it more difficult to detect.(Citation: Bitdefender FunnyDream Campaign November 2020) Command and control (C2) communications are hidden (but not necessarily encrypted) in an attempt to make the content more difficult to discover or decipher and to make the communication less conspicuous and hide commands from being seen."
    },
    "T1039": {
        "name": "Data from Network Shared Drive",
        "description": "Adversaries may search network shares on computers they have compromised to find files of interest."
    },
    "T1584.006": {
        "name": "Web Services",
        "description": "Adversaries may compromise access to third-party web services that can be used during targeting."
    },
    "T1601": {
        "name": "Modify System Image",
        "description": "Adversaries may make changes to the operating system of embedded network devices to weaken defenses and provide new capabilities for themselves."
    },
    "T1574": {
        "name": "Hijack Execution Flow",
        "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs."
    },
    "T1036.012": {
        "name": "Browser Fingerprint",
        "description": "Adversaries may attempt to blend in with legitimate traffic by spoofing browser and system attributes like operating system, system language, platform, user-agent string, resolution, time zone, etc."
    },
    "T1059.011": {
        "name": "Lua",
        "description": "Adversaries may abuse Lua commands and scripts for execution."
    },
    "T1027.005": {
        "name": "Indicator Removal from Tools",
        "description": "Adversaries may remove indicators from tools if they believe their malicious tool was detected, quarantined, or otherwise curtailed."
    },
    "T1204.003": {
        "name": "Malicious Image",
        "description": "Adversaries may rely on a user running a malicious image to facilitate execution."
    },
    "T1543.005": {
        "name": "Container Service",
        "description": "Adversaries may create or modify container or container cluster management tools that run as daemons, agents, or services on individual hosts."
    },
    "T1078": {
        "name": "Valid Accounts",
        "description": "Adversaries may obtain and abuse credentials of existing accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion."
    },
    "T1571": {
        "name": "Non-Standard Port",
        "description": "Adversaries may communicate using a protocol and port pairing that are typically not associated."
    },
    "T1585.001": {
        "name": "Social Media Accounts",
        "description": "Adversaries may create and cultivate social media accounts that can be used during targeting."
    },
    "T1073": {
        "name": "DLL Side-Loading",
        "description": "Programs may specify DLLs that are loaded at runtime."
    },
    "T1055.012": {
        "name": "Process Hollowing",
        "description": "Adversaries may inject malicious code into suspended and hollowed processes in order to evade process-based defenses."
    },
    "T1068": {
        "name": "Exploitation for Privilege Escalation",
        "description": "Adversaries may exploit software vulnerabilities in an attempt to elevate privileges."
    },
    "T1564.009": {
        "name": "Resource Forking",
        "description": "Adversaries may abuse resource forks to hide malicious code or executables to evade detection and bypass security applications."
    },
    "T1531": {
        "name": "Account Access Removal",
        "description": "Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users."
    },
    "T1110.004": {
        "name": "Credential Stuffing",
        "description": "Adversaries may use credentials obtained from breach dumps of unrelated accounts to gain access to target accounts through credential overlap."
    },
    "T1208": {
        "name": "Kerberoasting",
        "description": "Service principal names (SPNs) are used to uniquely identify each instance of a Windows service."
    },
    "T1027": {
        "name": "Obfuscated Files or Information",
        "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit."
    },
    "T1556.006": {
        "name": "Multi-Factor Authentication",
        "description": "Adversaries may disable or modify multi-factor authentication (MFA) mechanisms to enable persistent access to compromised accounts.\n\nOnce adversaries have gained access to a network by either compromising an account lacking MFA or by employing an MFA bypass method such as [Multi-Factor Authentication Request Generation](https://attack.mitre.org/techniques/T1621), adversaries may leverage their access to modify or completely disable MFA defenses."
    },
    "T1114.002": {
        "name": "Remote Email Collection",
        "description": "Adversaries may target an Exchange server, Office 365, or Google Workspace to collect sensitive information."
    },
    "T1505.004": {
        "name": "IIS Components",
        "description": "Adversaries may install malicious components that run on Internet Information Services (IIS) web servers to establish persistence."
    },
    "T1036.001": {
        "name": "Invalid Code Signature",
        "description": "Adversaries may attempt to mimic features of valid code signatures to increase the chance of deceiving a user, analyst, or tool."
    },
    "T1564.006": {
        "name": "Run Virtual Instance",
        "description": "Adversaries may carry out malicious operations using a virtual instance to avoid detection."
    },
    "T1154": {
        "name": "Trap",
        "description": "The <code>trap</code> command allows programs and shells to specify commands that will be executed upon receiving interrupt signals."
    },
    "T1027.014": {
        "name": "Polymorphic Code",
        "description": "Adversaries may utilize polymorphic code (also known as metamorphic or mutating code) to evade detection."
    },
    "T1201": {
        "name": "Password Policy Discovery",
        "description": "Adversaries may attempt to access detailed information about the password policy used within an enterprise network or cloud environment."
    },
    "T1546": {
        "name": "Event Triggered Execution",
        "description": "Adversaries may establish persistence and/or elevate privileges using system mechanisms that trigger execution based on specific events."
    },
    "T1546.004": {
        "name": "Unix Shell Configuration Modification",
        "description": "Adversaries may establish persistence through executing malicious commands triggered by a user’s shell."
    },
    "T1187": {
        "name": "Forced Authentication",
        "description": "Adversaries may gather credential material by invoking or forcing a user to automatically provide authentication information through a mechanism in which they can intercept.\n\nThe Server Message Block (SMB) protocol is commonly used in Windows networks for authentication and communication between systems for access to resources and file sharing."
    },
    "T1134.005": {
        "name": "SID-History Injection",
        "description": "Adversaries may use SID-History Injection to escalate privileges and bypass access controls."
    },
    "T1599": {
        "name": "Network Boundary Bridging",
        "description": "Adversaries may bridge network boundaries by compromising perimeter network devices or internal devices responsible for network segmentation."
    },
    "T1486": {
        "name": "Data Encrypted for Impact",
        "description": "Adversaries may encrypt data on target systems or on large numbers of systems in a network to interrupt availability to system and network resources."
    },
    "T1488": {
        "name": "Disk Content Wipe",
        "description": "Adversaries may erase the contents of storage devices on specific systems as well as large numbers of systems in a network to interrupt availability to system and network resources.\n\nAdversaries may partially or completely overwrite the contents of a storage device rendering the data irrecoverable through the storage interface.(Citation: Novetta Blockbuster)(Citation: Novetta Blockbuster Destructive Malware)(Citation: DOJ Lazarus Sony 2018) Instead of wiping specific disk structures or files, adversaries with destructive intent may wipe arbitrary portions of disk content."
    },
    "T1553": {
        "name": "Subvert Trust Controls",
        "description": "Adversaries may undermine security controls that will either warn users of untrusted activity or prevent execution of untrusted programs."
    },
    "T1548.004": {
        "name": "Elevated Execution with Prompt",
        "description": "Adversaries may leverage the <code>AuthorizationExecuteWithPrivileges</code> API to escalate privileges by prompting the user for credentials.(Citation: AppleDocs AuthorizationExecuteWithPrivileges) The purpose of this API is to give application developers an easy way to perform operations with root privileges, such as for application installation or updating."
    },
    "T1592.003": {
        "name": "Firmware",
        "description": "Adversaries may gather information about the victim's host firmware that can be used during targeting."
    },
    "T1573": {
        "name": "Encrypted Channel",
        "description": "Adversaries may employ an encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol."
    },
    "T1174": {
        "name": "Password Filter DLL",
        "description": "Windows password filters are password policy enforcement mechanisms for both domain and local accounts."
    },
    "T1547.002": {
        "name": "Authentication Package",
        "description": "Adversaries may abuse authentication packages to execute DLLs when the system boots."
    },
    "T1218.010": {
        "name": "Regsvr32",
        "description": "Adversaries may abuse Regsvr32.exe to proxy execution of malicious code."
    },
    "T1002": {
        "name": "Data Compressed",
        "description": "An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network."
    },
    "T1567.003": {
        "name": "Exfiltration to Text Storage Sites",
        "description": "Adversaries may exfiltrate data to text storage sites instead of their primary command and control channel."
    },
    "T1081": {
        "name": "Credentials in Files",
        "description": "Adversaries may search local file systems and remote file shares for files containing passwords."
    },
    "T1592.002": {
        "name": "Software",
        "description": "Adversaries may gather information about the victim's host software that can be used during targeting."
    },
    "T1128": {
        "name": "Netsh Helper DLL",
        "description": "Netsh.exe (also referred to as Netshell) is a command-line scripting utility used to interact with the network configuration of a system."
    },
    "T1056": {
        "name": "Input Capture",
        "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information."
    },
    "T1566.004": {
        "name": "Spearphishing Voice",
        "description": "Adversaries may use voice communications to ultimately gain access to victim systems."
    },
    "T1587.004": {
        "name": "Exploits",
        "description": "Adversaries may develop exploits that can be used during targeting."
    },
    "T1593.001": {
        "name": "Social Media",
        "description": "Adversaries may search social media for information about victims that can be used during targeting."
    },
    "T1213.004": {
        "name": "Customer Relationship Management Software",
        "description": "Adversaries may leverage Customer Relationship Management (CRM) software to mine valuable information."
    },
    "T1546.015": {
        "name": "Component Object Model Hijacking",
        "description": "Adversaries may establish persistence by executing malicious content triggered by hijacked references to Component Object Model (COM) objects."
    },
    "T1589.001": {
        "name": "Credentials",
        "description": "Adversaries may gather credentials that can be used during targeting."
    },
    "T1195.002": {
        "name": "Compromise Software Supply Chain",
        "description": "Adversaries may manipulate application software prior to receipt by a final consumer for the purpose of data or system compromise."
    },
    "T1036.003": {
        "name": "Rename Legitimate Utilities",
        "description": "Adversaries may rename legitimate / system utilities to try to evade security mechanisms concerning the usage of those utilities."
    },
    "T1102.002": {
        "name": "Bidirectional Communication",
        "description": "Adversaries may use an existing, legitimate external Web service as a means for sending commands to and receiving output from a compromised system over the Web service channel."
    },
    "T1203": {
        "name": "Exploitation for Client Execution",
        "description": "Adversaries may exploit software vulnerabilities in client applications to execute code."
    },
    "T1595.003": {
        "name": "Wordlist Scanning",
        "description": "Adversaries may iteratively probe infrastructure using brute-forcing and crawling techniques."
    },
    "T1667": {
        "name": "Email Bombing",
        "description": "Adversaries may flood targeted email addresses with an overwhelming volume of messages."
    },
    "T1562.011": {
        "name": "Spoof Security Alerting",
        "description": "Adversaries may spoof security alerting from tools, presenting false evidence to impair defenders’ awareness of malicious activity.(Citation: BlackBasta) Messages produced by defensive tools contain information about potential security events as well as the functioning status of security software and the system."
    },
    "T1137.004": {
        "name": "Outlook Home Page",
        "description": "Adversaries may abuse Microsoft Outlook's Home Page feature to obtain persistence on a compromised system."
    },
    "T1573.002": {
        "name": "Asymmetric Cryptography",
        "description": "Adversaries may employ a known asymmetric encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol."
    },
    "T1567.002": {
        "name": "Exfiltration to Cloud Storage",
        "description": "Adversaries may exfiltrate data to a cloud storage service rather than over their primary command and control channel."
    },
    "T1570": {
        "name": "Lateral Tool Transfer",
        "description": "Adversaries may transfer tools or other files between systems in a compromised environment."
    },
    "T1574.009": {
        "name": "Path Interception by Unquoted Path",
        "description": "Adversaries may execute their own malicious payloads by hijacking vulnerable file path references."
    },
    "T1608.003": {
        "name": "Install Digital Certificate",
        "description": "Adversaries may install SSL/TLS certificates that can be used during targeting."
    },
    "T1168": {
        "name": "Local Job Scheduling",
        "description": "On Linux and macOS systems, multiple methods are supported for creating pre-scheduled and periodic background jobs: cron, (Citation: Die.net Linux crontab Man Page) at, (Citation: Die.net Linux at Man Page) and launchd."
    },
    "T1166": {
        "name": "Setuid and Setgid",
        "description": "When the setuid or setgid bits are set on Linux or macOS for an application, this means that the application will run with the privileges of the owning user or group respectively  (Citation: setuid man page)."
    },
    "T1037.005": {
        "name": "Startup Items",
        "description": "Adversaries may use startup items automatically executed at boot initialization to establish persistence."
    },
    "T1100": {
        "name": "Web Shell",
        "description": "A Web shell is a Web script that is placed on an openly accessible Web server to allow an adversary to use the Web server as a gateway into a network."
    },
    "T1186": {
        "name": "Process Doppelgänging",
        "description": "Windows Transactional NTFS (TxF) was introduced in Vista as a method to perform safe file operations."
    },
    "T1184": {
        "name": "SSH Hijacking",
        "description": "Secure Shell (SSH) is a standard means of remote access on Linux and macOS systems."
    },
    "T1614.001": {
        "name": "System Language Discovery",
        "description": "Adversaries may attempt to gather information about the system language of a victim in order to infer the geographical location of that host."
    },
    "T1095": {
        "name": "Non-Application Layer Protocol",
        "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network."
    },
    "T1075": {
        "name": "Pass the Hash",
        "description": "Pass the hash (PtH) is a method of authenticating as a user without having access to the user's cleartext password."
    },
    "T1059.013": {
        "name": "Container CLI/API",
        "description": "Adversaries may abuse built-in CLI tools or API calls to execute malicious commands in containerized environments.\n\nThe Docker CLI is used for managing containers via an exposed API point from the `dockerd` daemon."
    },
    "T1027.003": {
        "name": "Steganography",
        "description": "Adversaries may use steganography techniques in order to prevent the detection of hidden information."
    },
    "T1584.002": {
        "name": "DNS Server",
        "description": "Adversaries may compromise third-party DNS servers that can be used during targeting."
    },
    "T1671": {
        "name": "Cloud Application Integration",
        "description": "Adversaries may achieve persistence by leveraging OAuth application integrations in a software-as-a-service environment."
    },
    "T1001.003": {
        "name": "Protocol or Service Impersonation",
        "description": "Adversaries may impersonate legitimate protocols or web service traffic to disguise command and control activity and thwart analysis efforts."
    },
    "T1012": {
        "name": "Query Registry",
        "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\n\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security.(Citation: Wikipedia Windows Registry) Information can easily be queried using the [Reg](https://attack.mitre.org/software/S0075) utility, though other means to access the Registry exist."
    },
    "T1030": {
        "name": "Data Transfer Size Limits",
        "description": "An adversary may exfiltrate data in fixed size chunks instead of whole files or limit packet sizes below certain thresholds."
    },
    "T1028": {
        "name": "Windows Remote Management",
        "description": "Windows Remote Management (WinRM) is the name of both a Windows service and a protocol that allows a user to interact with a remote system (e.g., run an executable, modify the Registry, modify services)."
    },
    "T1550.004": {
        "name": "Web Session Cookie",
        "description": "Adversaries can use stolen session cookies to authenticate to web applications and services."
    },
    "T1078.002": {
        "name": "Domain Accounts",
        "description": "Adversaries may obtain and abuse credentials of a domain account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion.(Citation: TechNet Credential Theft) Domain accounts are those managed by Active Directory Domain Services where access and permissions are configured across systems and services that are part of that domain."
    },
    "T1218.009": {
        "name": "Regsvcs/Regasm",
        "description": "Adversaries may abuse Regsvcs and Regasm to proxy execution of code through a trusted Windows utility."
    },
    "T1034": {
        "name": "Path Interception",
        "description": "**This technique has been deprecated."
    },
    "T1546.018": {
        "name": "Python Startup Hooks",
        "description": "Adversaries may achieve persistence by leveraging Python’s startup mechanisms, including path configuration (`.pth`) files and the `sitecustomize.py` or `usercustomize.py` modules."
    },
    "T1506": {
        "name": "Web Session Cookie",
        "description": "Adversaries can use stolen session cookies to authenticate to web applications and services."
    },
    "T1553.004": {
        "name": "Install Root Certificate",
        "description": "Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers."
    },
    "T1037.003": {
        "name": "Network Logon Script",
        "description": "Adversaries may use network logon scripts automatically executed at logon initialization to establish persistence."
    },
    "T1499": {
        "name": "Endpoint Denial of Service",
        "description": "Adversaries may perform Endpoint Denial of Service (DoS) attacks to degrade or block the availability of services to users."
    },
    "T1027.004": {
        "name": "Compile After Delivery",
        "description": "Adversaries may attempt to make payloads difficult to discover and analyze by delivering files to victims as uncompiled code."
    },
    "T1065": {
        "name": "Uncommonly Used Port",
        "description": "Adversaries may conduct C2 communications over a non-standard port to bypass proxies and firewalls that have been improperly configured.."
    },
    "T1614": {
        "name": "System Location Discovery",
        "description": "\nAdversaries may gather information in an attempt to calculate the geographical location of a victim host."
    },
    "T1564.007": {
        "name": "VBA Stomping",
        "description": "Adversaries may hide malicious Visual Basic for Applications (VBA) payloads embedded within MS Office documents by replacing the VBA source code with benign data.(Citation: FireEye VBA stomp Feb 2020)\n\nMS Office documents with embedded VBA content store source code inside of module streams."
    },
    "T1197": {
        "name": "BITS Jobs",
        "description": "Adversaries may abuse BITS jobs to persistently execute code and perform various background tasks."
    },
    "T1127.001": {
        "name": "MSBuild",
        "description": "Adversaries may use MSBuild to proxy execution of code through a trusted Windows utility."
    },
    "T1656": {
        "name": "Impersonation",
        "description": "Adversaries may impersonate a trusted person or organization in order to persuade and trick a target into performing some action on their behalf."
    },
    "T1578.005": {
        "name": "Modify Cloud Compute Configurations",
        "description": "Adversaries may modify settings that directly affect the size, locations, and resources available to cloud compute infrastructure in order to evade defenses."
    },
    "T1088": {
        "name": "Bypass User Account Control",
        "description": "Windows User Account Control (UAC) allows a program to elevate its privileges to perform a task under administrator-level permissions by prompting the user for confirmation."
    },
    "T1494": {
        "name": "Runtime Data Manipulation",
        "description": "Adversaries may modify systems in order to manipulate the data as it is accessed and displayed to an end user.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating runtime data, adversaries may attempt to affect a business process, organizational understanding, and decision making."
    },
    "T1090.004": {
        "name": "Domain Fronting",
        "description": "Adversaries may take advantage of routing schemes in Content Delivery Networks (CDNs) and other services which host multiple domains to obfuscate the intended destination of HTTPS traffic or traffic tunneled through HTTPS."
    },
    "T1557.002": {
        "name": "ARP Cache Poisoning",
        "description": "Adversaries may poison Address Resolution Protocol (ARP) caches to position themselves between the communication of two or more networked devices."
    },
    "T1562.008": {
        "name": "Disable or Modify Cloud Logs",
        "description": "An adversary may disable or modify cloud logging capabilities and integrations to limit what data is collected on their activities and avoid detection."
    },
    "T1518.001": {
        "name": "Security Software Discovery",
        "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment."
    },
    "T1564.003": {
        "name": "Hidden Window",
        "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users."
    },
    "T1493": {
        "name": "Transmitted Data Manipulation",
        "description": "Adversaries may alter data en route to storage or other systems in order to manipulate external outcomes or hide activity.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating transmitted data, adversaries may attempt to affect a business process, organizational understanding, and decision making."
    },
    "T1127.002": {
        "name": "ClickOnce",
        "description": "Adversaries may use ClickOnce applications (.appref-ms and .application files) to proxy execution of code through a trusted Windows utility.(Citation: Burke/CISA ClickOnce BlackHat) ClickOnce is a deployment that enables a user to create self-updating Windows-based .NET applications (i.e, .XBAP, .EXE, or .DLL) that install and run from a file share or web page with minimal user interaction."
    },
    "T1059.006": {
        "name": "Python",
        "description": "Adversaries may abuse Python commands and scripts for execution."
    },
    "T1070.010": {
        "name": "Relocate Malware",
        "description": "Once a payload is delivered, adversaries may reproduce copies of the same malware on the victim system to remove evidence of their presence and/or avoid defenses."
    },
    "T1591.004": {
        "name": "Identify Roles",
        "description": "Adversaries may gather information about identities and roles within the victim organization that can be used during targeting."
    },
    "T1132": {
        "name": "Data Encoding",
        "description": "Adversaries may encode data to make the content of command and control traffic more difficult to detect."
    },
    "T1546.010": {
        "name": "AppInit DLLs",
        "description": "Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by AppInit DLLs loaded into processes."
    },
    "T1598": {
        "name": "Phishing for Information",
        "description": "Adversaries may send phishing messages to elicit sensitive information that can be used during targeting."
    },
    "T1496": {
        "name": "Resource Hijacking",
        "description": "Adversaries may leverage the resources of co-opted systems to complete resource-intensive tasks, which may impact system and/or hosted service availability."
    },
    "T1585": {
        "name": "Establish Accounts",
        "description": "Adversaries may create and cultivate accounts with services that can be used during targeting."
    },
    "T1588": {
        "name": "Obtain Capabilities",
        "description": "Adversaries may buy and/or steal capabilities that can be used during targeting."
    },
    "T1546.002": {
        "name": "Screensaver",
        "description": "Adversaries may establish persistence by executing malicious content triggered by user inactivity."
    },
    "T1147": {
        "name": "Hidden Users",
        "description": "Every user account in macOS has a userID associated with it."
    },
    "T1556.009": {
        "name": "Conditional Access Policies",
        "description": "Adversaries may disable or modify conditional access policies to enable persistent access to compromised accounts."
    },
    "T1578.002": {
        "name": "Create Cloud Instance",
        "description": "An adversary may create a new instance or virtual machine (VM) within the compute service of a cloud account to evade defenses."
    },
    "T1500": {
        "name": "Compile After Delivery",
        "description": "Adversaries may attempt to make payloads difficult to discover and analyze by delivering files to victims as uncompiled code."
    },
    "T1555.006": {
        "name": "Cloud Secrets Management Stores",
        "description": "Adversaries may acquire credentials from cloud-native secret management solutions such as AWS Secrets Manager, GCP Secret Manager, Azure Key Vault, and Terraform Vault."
    },
    "T1213.003": {
        "name": "Code Repositories",
        "description": "Adversaries may leverage code repositories to collect valuable information."
    },
    "T1565.002": {
        "name": "Transmitted Data Manipulation",
        "description": "Adversaries may alter data en route to storage or other systems in order to manipulate external outcomes or hide activity, thus threatening the integrity of the data.(Citation: FireEye APT38 Oct 2018)(Citation: DOJ Lazarus Sony 2018) By manipulating transmitted data, adversaries may attempt to affect a business process, organizational understanding, and decision making.\n\nManipulation may be possible over a network connection or between system processes where there is an opportunity deploy a tool that will intercept and change information."
    },
    "T1003.008": {
        "name": "/etc/passwd and /etc/shadow",
        "description": "Adversaries may attempt to dump the contents of <code>/etc/passwd</code> and <code>/etc/shadow</code> to enable offline password cracking."
    },
    "T1543.001": {
        "name": "Launch Agent",
        "description": "Adversaries may create or modify launch agents to repeatedly execute malicious payloads as part of persistence."
    },
    "T1569": {
        "name": "System Services",
        "description": "Adversaries may abuse system services or daemons to execute commands or programs."
    },
    "T1059.003": {
        "name": "Windows Command Shell",
        "description": "Adversaries may abuse the Windows command shell for execution."
    },
    "T1055.009": {
        "name": "Proc Memory",
        "description": "Adversaries may inject malicious code into processes via the /proc filesystem in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1223": {
        "name": "Compiled HTML File",
        "description": "Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system."
    },
    "T1650": {
        "name": "Acquire Access",
        "description": "Adversaries may purchase or otherwise acquire an existing access to a target system or network."
    },
    "T1601.001": {
        "name": "Patch System Image",
        "description": "Adversaries may modify the operating system of a network device to introduce new capabilities or weaken existing defenses.(Citation: Killing the myth of Cisco IOS rootkits) (Citation: Killing IOS diversity myth) (Citation: Cisco IOS Shellcode) (Citation: Cisco IOS Forensics Developments) (Citation: Juniper Netscreen of the Dead) Some network devices are built with a monolithic architecture, where the entire operating system and most of the functionality of the device is contained within a single file."
    },
    "T1558.002": {
        "name": "Silver Ticket",
        "description": "Adversaries who have the password hash of a target service account (e.g."
    },
    "T1213": {
        "name": "Data from Information Repositories",
        "description": "Adversaries may leverage information repositories to mine valuable information."
    },
    "T1070.009": {
        "name": "Clear Persistence",
        "description": "Adversaries may clear artifacts associated with previously established persistence on a host system to remove evidence of their activity."
    },
    "T1059.012": {
        "name": "Hypervisor CLI",
        "description": "Adversaries may abuse hypervisor command line interpreters (CLIs) to execute malicious commands."
    },
    "T1146": {
        "name": "Clear Command History",
        "description": "In addition to clearing system logs, an adversary may clear the command history of a compromised account to conceal the actions undertaken during an intrusion."
    },
    "T1555.004": {
        "name": "Windows Credential Manager",
        "description": "Adversaries may acquire credentials from the Windows Credential Manager."
    },
    "T1036.010": {
        "name": "Masquerade Account Name",
        "description": "Adversaries may match or approximate the names of legitimate accounts to make newly created ones appear benign."
    },
    "T1519": {
        "name": "Emond",
        "description": "Adversaries may use Event Monitor Daemon (emond) to establish persistence by scheduling malicious commands to run on predictable event triggers."
    },
    "T1194": {
        "name": "Spearphishing via Service",
        "description": "Spearphishing via service is a specific variant of spearphishing."
    },
    "T1200": {
        "name": "Hardware Additions",
        "description": "Adversaries may physically introduce computer accessories, networking hardware, or other computing devices into a system or network that can be used as a vector to gain access."
    },
    "T1219.002": {
        "name": "Remote Desktop Software",
        "description": "An adversary may use legitimate desktop support software to establish an interactive command and control channel to target systems within networks."
    },
    "T1505": {
        "name": "Server Software Component",
        "description": "Adversaries may abuse legitimate extensible development features of servers to establish persistent access to systems."
    },
    "T1485": {
        "name": "Data Destruction",
        "description": "Adversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources."
    },
    "T1132.002": {
        "name": "Non-Standard Encoding",
        "description": "Adversaries may encode data with a non-standard data encoding system to make the content of command and control traffic more difficult to detect."
    },
    "T1556.001": {
        "name": "Domain Controller Authentication",
        "description": "Adversaries may patch the authentication process on a domain controller to bypass the typical authentication mechanisms and enable access to accounts."
    },
    "T1537": {
        "name": "Transfer Data to Cloud Account",
        "description": "Adversaries may exfiltrate data by transferring the data, including through sharing/syncing and creating backups of cloud environments, to another cloud account they control on the same service.\n\nA defender who is monitoring for large transfers to outside the cloud environment through normal file transfers or over command and control channels may not be watching for data transfers to another account within the same cloud provider."
    },
    "T1027.006": {
        "name": "HTML Smuggling",
        "description": "Adversaries may smuggle data and files past content filters by hiding malicious payloads inside of seemingly benign HTML files."
    },
    "T1556.005": {
        "name": "Reversible Encryption",
        "description": "An adversary may abuse Active Directory authentication encryption properties to gain access to credentials on Windows systems."
    },
    "T1027.010": {
        "name": "Command Obfuscation",
        "description": "Adversaries may obfuscate content during command execution to impede detection."
    },
    "T1130": {
        "name": "Install Root Certificate",
        "description": "Root certificates are used in public key cryptography to identify a root certificate authority (CA)."
    },
    "T1022": {
        "name": "Data Encrypted",
        "description": "Data is encrypted before being exfiltrated in order to hide the information that is being exfiltrated from detection or to make the exfiltration less conspicuous upon inspection by a defender."
    },
    "T1070.004": {
        "name": "File Deletion",
        "description": "Adversaries may delete files left behind by the actions of their intrusion activity."
    },
    "T1189": {
        "name": "Drive-by Compromise",
        "description": "Adversaries may gain access to a system through a user visiting a website over the normal course of browsing."
    },
    "T1498": {
        "name": "Network Denial of Service",
        "description": "Adversaries may perform Network Denial of Service (DoS) attacks to degrade or block the availability of targeted resources to users."
    },
    "T1651": {
        "name": "Cloud Administration Command",
        "description": "Adversaries may abuse cloud management services to execute commands within virtual machines."
    },
    "T1546.016": {
        "name": "Installer Packages",
        "description": "Adversaries may establish persistence and elevate privileges by using an installer to trigger the execution of malicious content."
    },
    "T1595.001": {
        "name": "Scanning IP Blocks",
        "description": "Adversaries may scan victim IP blocks to gather information that can be used during targeting."
    },
    "T1158": {
        "name": "Hidden Files and Directories",
        "description": "To prevent normal users from accidentally changing special files on a system, most operating systems have the concept of a ‘hidden’ file."
    },
    "T1221": {
        "name": "Template Injection",
        "description": "Adversaries may create or modify references in user document templates to conceal malicious code or force authentication attempts."
    },
    "T1037.004": {
        "name": "RC Scripts",
        "description": "Adversaries may establish persistence by modifying RC scripts, which are executed during a Unix-like system’s startup."
    },
    "T1134": {
        "name": "Access Token Manipulation",
        "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls."
    },
    "T1209": {
        "name": "Time Providers",
        "description": "The Windows Time service (W32Time) enables time synchronization across and within domains."
    },
    "T1111": {
        "name": "Multi-Factor Authentication Interception",
        "description": "Adversaries may target multi-factor authentication (MFA) mechanisms, (i.e., smart cards, token generators, etc.) to gain access to credentials that can be used to access systems, services, and network resources."
    },
    "T1159": {
        "name": "Launch Agent",
        "description": "Per Apple’s developer documentation, when a user logs in, a per-user launchd process is started which loads the parameters for each launch-on-demand user agent from the property list (plist) files found in <code>/System/Library/LaunchAgents</code>, <code>/Library/LaunchAgents</code>, and <code>$HOME/Library/LaunchAgents</code> (Citation: AppleDocs Launch Agent Daemons) (Citation: OSX Keydnap malware) (Citation: Antiquated Mac Malware)."
    },
    "T1027.002": {
        "name": "Software Packing",
        "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code."
    },
    "T1584.007": {
        "name": "Serverless",
        "description": "Adversaries may compromise serverless cloud infrastructure, such as Cloudflare Workers, AWS Lambda functions, or Google Apps Scripts, that can be used during targeting."
    },
    "T1071.001": {
        "name": "Web Protocols",
        "description": "Adversaries may communicate using application layer protocols associated with web traffic to avoid detection/network filtering by blending in with existing traffic."
    },
    "T1059.005": {
        "name": "Visual Basic",
        "description": "Adversaries may abuse Visual Basic (VB) for execution."
    },
    "T1564.005": {
        "name": "Hidden File System",
        "description": "Adversaries may use a hidden file system to conceal malicious activity from users and security tools."
    },
    "T1543.002": {
        "name": "Systemd Service",
        "description": "Adversaries may create or modify systemd services to repeatedly execute malicious payloads as part of persistence."
    },
    "T1668": {
        "name": "Exclusive Control",
        "description": "Adversaries who successfully compromise a system may attempt to maintain persistence by “closing the door” behind them  – in other words, by preventing other threat actors from initially accessing or maintaining a foothold on the same system."
    },
    "T1563.002": {
        "name": "RDP Hijacking",
        "description": "Adversaries may hijack a legitimate user’s remote desktop session to move laterally within an environment."
    },
    "T1136": {
        "name": "Create Account",
        "description": "Adversaries may create an account to maintain access to victim systems.(Citation: Symantec WastedLocker June 2020) With a sufficient level of access, creating such accounts may be used to establish secondary credentialed access that do not require persistent remote access tools to be deployed on the system.\n\nAccounts may be created on the local system or within a domain or cloud tenant."
    },
    "T1547.013": {
        "name": "XDG Autostart Entries",
        "description": "Adversaries may add or modify XDG Autostart Entries to execute malicious programs or commands when a user’s desktop environment is loaded at login."
    },
    "T1584.004": {
        "name": "Server",
        "description": "Adversaries may compromise third-party servers that can be used during targeting."
    },
    "T1672": {
        "name": "Email Spoofing",
        "description": "Adversaries may fake, or spoof, a sender’s identity by modifying the value of relevant email headers in order to establish contact with victims under false pretenses.(Citation: Proofpoint TA427 April 2024) In addition to actual email content, email headers (such as the FROM header, which contains the email address of the sender) may also be modified."
    },
    "T1526": {
        "name": "Cloud Service Discovery",
        "description": "An adversary may attempt to enumerate the cloud services running on a system after gaining access."
    },
    "T1204.004": {
        "name": "Malicious Copy and Paste",
        "description": "An adversary may rely upon a user copying and pasting code in order to gain execution."
    },
    "T1151": {
        "name": "Space after Filename",
        "description": "Adversaries can hide a program's true filetype by changing the extension of a file."
    },
    "T1018": {
        "name": "Remote System Discovery",
        "description": "Adversaries may attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for Lateral Movement from the current system."
    },
    "T1046": {
        "name": "Network Service Discovery",
        "description": "Adversaries may attempt to get a listing of services running on remote hosts and local network infrastructure devices, including those that may be vulnerable to remote software exploitation."
    },
    "T1590.001": {
        "name": "Domain Properties",
        "description": "Adversaries may gather information about the victim's network domain(s) that can be used during targeting."
    },
    "T1518": {
        "name": "Software Discovery",
        "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment."
    },
    "T1538": {
        "name": "Cloud Service Dashboard",
        "description": "An adversary may use a cloud service dashboard GUI with stolen credentials to gain useful information from an operational cloud environment, such as specific services, resources, and features."
    },
    "T1055.005": {
        "name": "Thread Local Storage",
        "description": "Adversaries may inject malicious code into processes via thread local storage (TLS) callbacks in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1622": {
        "name": "Debugger Evasion",
        "description": "Adversaries may employ various means to detect and avoid debuggers."
    },
    "T1036.006": {
        "name": "Space after Filename",
        "description": "Adversaries can hide a program's true filetype by changing the extension of a file."
    },
    "T1547.007": {
        "name": "Re-opened Applications",
        "description": "Adversaries may modify plist files to automatically run an application when a user logs in."
    },
    "T1608.006": {
        "name": "SEO Poisoning",
        "description": "Adversaries may poison mechanisms that influence search engine optimization (SEO) to further lure staged capabilities towards potential victims."
    },
    "T1550.002": {
        "name": "Pass the Hash",
        "description": "Adversaries may “pass the hash” using stolen password hashes to move laterally within an environment, bypassing normal system access controls."
    },
    "T1052": {
        "name": "Exfiltration Over Physical Medium",
        "description": "Adversaries may attempt to exfiltrate data via a physical medium, such as a removable drive."
    },
    "T1574.002": {
        "name": "DLL Side-Loading",
        "description": "Adversaries may execute their own malicious payloads by side-loading DLLs."
    },
    "T1105": {
        "name": "Ingress Tool Transfer",
        "description": "Adversaries may transfer tools or other files from an external system into a compromised environment."
    },
    "T1216.002": {
        "name": "SyncAppvPublishingServer",
        "description": "Adversaries may abuse SyncAppvPublishingServer.vbs to proxy execution of malicious [PowerShell](https://attack.mitre.org/techniques/T1059/001) commands."
    },
    "T1098.002": {
        "name": "Additional Email Delegate Permissions",
        "description": "Adversaries may grant additional permission levels to maintain persistent access to an adversary-controlled email account."
    },
    "T1588.003": {
        "name": "Code Signing Certificates",
        "description": "Adversaries may buy and/or steal code signing certificates that can be used during targeting."
    },
    "T1126": {
        "name": "Network Share Connection Removal",
        "description": "Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation."
    },
    "T1648": {
        "name": "Serverless Execution",
        "description": "Adversaries may abuse serverless computing, integration, and automation services to execute arbitrary code in cloud environments."
    },
    "T1548.006": {
        "name": "TCC Manipulation",
        "description": "Adversaries can manipulate or abuse the Transparency, Consent, & Control (TCC) service or database to grant malicious executables elevated permissions."
    },
    "T1084": {
        "name": "Windows Management Instrumentation Event Subscription",
        "description": "Windows Management Instrumentation (WMI) can be used to install event filters, providers, consumers, and bindings that execute code when a defined event occurs."
    },
    "T1160": {
        "name": "Launch Daemon",
        "description": "Per Apple’s developer documentation, when macOS and OS X boot up, launchd is run to finish system initialization."
    },
    "T1055.008": {
        "name": "Ptrace System Calls",
        "description": "Adversaries may inject malicious code into processes via ptrace (process trace) system calls in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1653": {
        "name": "Power Settings",
        "description": "Adversaries may impair a system's ability to hibernate, reboot, or shut down in order to extend access to infected machines."
    },
    "T1027.007": {
        "name": "Dynamic API Resolution",
        "description": "Adversaries may obfuscate then dynamically resolve API functions called by their malware in order to conceal malicious functionalities and impair defensive analysis."
    },
    "T1021.001": {
        "name": "Remote Desktop Protocol",
        "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to log into a computer using the Remote Desktop Protocol (RDP)."
    },
    "T1037.001": {
        "name": "Logon Script (Windows)",
        "description": "Adversaries may use Windows logon scripts automatically executed at logon initialization to establish persistence."
    },
    "T1055.015": {
        "name": "ListPlanting",
        "description": "Adversaries may abuse list-view controls to inject malicious code into hijacked processes in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1665": {
        "name": "Hide Infrastructure",
        "description": "Adversaries may manipulate network traffic in order to hide and evade detection of their C2 infrastructure."
    },
    "T1484": {
        "name": "Domain or Tenant Policy Modification",
        "description": "Adversaries may modify the configuration settings of a domain or identity tenant to evade defenses and/or escalate privileges in centrally managed environments."
    },
    "T1220": {
        "name": "XSL Script Processing",
        "description": "Adversaries may bypass application control and obscure execution of code by embedding scripts inside XSL files."
    },
    "T1596.005": {
        "name": "Scan Databases",
        "description": "Adversaries may search within public scan databases for information about victims that can be used during targeting."
    },
    "T1564.001": {
        "name": "Hidden Files and Directories",
        "description": "Adversaries may set files and directories to be hidden to evade detection mechanisms."
    },
    "T1578.001": {
        "name": "Create Snapshot",
        "description": "An adversary may create a snapshot or data backup within a cloud account to evade defenses."
    },
    "T1591.001": {
        "name": "Determine Physical Locations",
        "description": "Adversaries may gather the victim's physical location(s) that can be used during targeting."
    },
    "T1137.002": {
        "name": "Office Test",
        "description": "Adversaries may abuse the Microsoft Office \"Office Test\" Registry key to obtain persistence on a compromised system."
    },
    "T1587": {
        "name": "Develop Capabilities",
        "description": "Adversaries may build capabilities that can be used during targeting."
    },
    "T1173": {
        "name": "Dynamic Data Exchange",
        "description": "Windows Dynamic Data Exchange (DDE) is a client-server protocol for one-time and/or continuous inter-process communication (IPC) between applications."
    },
    "T1003.003": {
        "name": "NTDS",
        "description": "Adversaries may attempt to access or create a copy of the Active Directory domain database in order to steal credential information, as well as obtain other information about domain members such as devices, users, and access rights."
    },
    "T1602.001": {
        "name": "SNMP (MIB Dump)",
        "description": "Adversaries may target the Management Information Base (MIB) to collect and/or mine valuable information in a network managed using Simple Network Management Protocol (SNMP).\n\nThe MIB is a configuration repository that stores variable information accessible via SNMP in the form of object identifiers (OID)."
    },
    "T1001.002": {
        "name": "Steganography",
        "description": "Adversaries may use steganographic techniques to hide command and control traffic to make detection efforts more difficult."
    },
    "T1204.001": {
        "name": "Malicious Link",
        "description": "An adversary may rely upon a user clicking a malicious link in order to gain execution."
    },
    "T1550.001": {
        "name": "Application Access Token",
        "description": "Adversaries may use stolen application access tokens to bypass the typical authentication process and access restricted accounts, information, or services on remote systems."
    },
    "T1547.008": {
        "name": "LSASS Driver",
        "description": "Adversaries may modify or add LSASS drivers to obtain persistence on compromised systems."
    },
    "T1569.002": {
        "name": "Service Execution",
        "description": "Adversaries may abuse the Windows service control manager to execute malicious commands or payloads."
    },
    "T1078.004": {
        "name": "Cloud Accounts",
        "description": "Valid accounts in cloud environments may allow adversaries to perform actions to achieve Initial Access, Persistence, Privilege Escalation, or Defense Evasion."
    },
    "T1480.001": {
        "name": "Environmental Keying",
        "description": "Adversaries may environmentally key payloads or other features of malware to evade defenses and constraint execution to a specific target environment."
    },
    "T1008": {
        "name": "Fallback Channels",
        "description": "Adversaries may use fallback or alternate communication channels if the primary channel is compromised or inaccessible in order to maintain reliable command and control and to avoid data transfer thresholds.."
    },
    "T1680": {
        "name": "Local Storage Discovery",
        "description": "Adversaries may enumerate local drives, disks, and/or volumes and their attributes like total or free space and volume serial number."
    },
    "T1564.004": {
        "name": "NTFS File Attributes",
        "description": "Adversaries may use NTFS file attributes to hide their malicious data in order to evade detection."
    },
    "T1558.003": {
        "name": "Kerberoasting",
        "description": "Adversaries may abuse a valid Kerberos ticket-granting ticket (TGT) or sniff network traffic to obtain a ticket-granting service (TGS) ticket that may be vulnerable to [Brute Force](https://attack.mitre.org/techniques/T1110).(Citation: Empire InvokeKerberoast Oct 2016)(Citation: AdSecurity Cracking Kerberos Dec 2015) \n\nService principal names (SPNs) are used to uniquely identify each instance of a Windows service."
    },
    "T1096": {
        "name": "NTFS File Attributes",
        "description": "Every New Technology File System (NTFS) formatted partition contains a Master File Table (MFT) that maintains a record for every file/directory on the partition."
    },
    "T1003.006": {
        "name": "DCSync",
        "description": "Adversaries may attempt to access credentials and other sensitive information by abusing a Windows Domain Controller's application programming interface (API)(Citation: Microsoft DRSR Dec 2017) (Citation: Microsoft GetNCCChanges) (Citation: Samba DRSUAPI) (Citation: Wine API samlib.dll) to simulate the replication process from a remote domain controller using a technique called DCSync.\n\nMembers of the Administrators, Domain Admins, and Enterprise Admin groups or computer accounts on the domain controller are able to run DCSync to pull password data(Citation: ADSecurity Mimikatz DCSync) from Active Directory, which may include current and historical hashes of potentially useful accounts such as KRBTGT and Administrators."
    },
    "T1124": {
        "name": "System Time Discovery",
        "description": "An adversary may gather the system time and/or time zone settings from a local or remote system."
    },
    "T1053.002": {
        "name": "At",
        "description": "Adversaries may abuse the [at](https://attack.mitre.org/software/S0110) utility to perform task scheduling for initial or recurring execution of malicious code."
    },
    "T1035": {
        "name": "Service Execution",
        "description": "Adversaries may execute a binary, command, or script via a method that interacts with Windows services, such as the Service Control Manager."
    },
    "T1055.001": {
        "name": "Dynamic-link Library Injection",
        "description": "Adversaries may inject dynamic-link libraries (DLLs) into processes in order to evade process-based defenses as well as possibly elevate privileges."
    },
    "T1086": {
        "name": "PowerShell",
        "description": "PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system."
    },
    "T1588.005": {
        "name": "Exploits",
        "description": "Adversaries may buy, steal, or download exploits that can be used during targeting."
    },
    "T1556": {
        "name": "Modify Authentication Process",
        "description": "Adversaries may modify authentication mechanisms and processes to access user credentials or enable otherwise unwarranted access to accounts."
    },
    "T1546.017": {
        "name": "Udev Rules",
        "description": "Adversaries may maintain persistence through executing malicious content triggered using udev rules."
    },
    "T1056.004": {
        "name": "Credential API Hooking",
        "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials."
    },
    "T1495": {
        "name": "Firmware Corruption",
        "description": "Adversaries may overwrite or corrupt the flash memory contents of system BIOS or other firmware in devices attached to a system in order to render them inoperable or unable to boot, thus denying the availability to use the devices and/or the system.(Citation: Symantec Chernobyl W95.CIH) Firmware is software that is loaded and executed from non-volatile memory on hardware devices in order to initialize and manage device functionality."
    },
    "T1490": {
        "name": "Inhibit System Recovery",
        "description": "Adversaries may delete or remove built-in data and turn off services designed to aid in the recovery of a corrupted system to prevent recovery.(Citation: Talos Olympic Destroyer 2018)(Citation: FireEye WannaCry 2017) This may deny access to available backups and recovery options.\n\nOperating systems may contain features that can help fix corrupted systems, such as a backup catalog, volume shadow copies, and automatic repair features."
    },
    "T1546.007": {
        "name": "Netsh Helper DLL",
        "description": "Adversaries may establish persistence by executing malicious content triggered by Netsh Helper DLLs."
    },
    "T1566.003": {
        "name": "Spearphishing via Service",
        "description": "Adversaries may send spearphishing messages via third-party services in an attempt to gain access to victim systems."
    },
    "T1090.001": {
        "name": "Internal Proxy",
        "description": "Adversaries may use an internal proxy to direct command and control traffic between two or more systems in a compromised environment."
    },
    "T1216": {
        "name": "System Script Proxy Execution",
        "description": "Adversaries may use trusted scripts, often signed with certificates, to proxy the execution of malicious files."
    },
    "T1094": {
        "name": "Custom Command and Control Protocol",
        "description": "Adversaries may communicate using a custom command and control protocol instead of encapsulating commands/data in an existing [Application Layer Protocol](https://attack.mitre.org/techniques/T1071)."
    },
    "T1102.001": {
        "name": "Dead Drop Resolver",
        "description": "Adversaries may use an existing, legitimate external Web service to host information that points to additional command and control (C2) infrastructure."
    },
    "T1118": {
        "name": "InstallUtil",
        "description": "InstallUtil is a command-line utility that allows for installation and uninstallation of resources by executing specific installer components specified in .NET binaries."
    },
    "T1001.001": {
        "name": "Junk Data",
        "description": "Adversaries may add junk data to protocols used for command and control to make detection more difficult.(Citation: FireEye SUNBURST Backdoor December 2020) By adding random or meaningless data to the protocols used for command and control, adversaries can prevent trivial methods for decoding, deciphering, or otherwise analyzing the traffic."
    },
    "T1598.001": {
        "name": "Spearphishing Service",
        "description": "Adversaries may send spearphishing messages via third-party services to elicit sensitive information that can be used during targeting."
    },
    "T1043": {
        "name": "Commonly Used Port",
        "description": "**This technique has been deprecated."
    },
    "T1505.006": {
        "name": "vSphere Installation Bundles",
        "description": "Adversaries may abuse vSphere Installation Bundles (VIBs) to establish persistent access to ESXi hypervisors."
    },
    "T1552.007": {
        "name": "Container API",
        "description": "Adversaries may gather credentials via APIs within a containers environment."
    },
    "T1584.001": {
        "name": "Domains",
        "description": "Adversaries may hijack domains and/or subdomains that can be used during targeting."
    },
    "T1505.001": {
        "name": "SQL Stored Procedures",
        "description": "Adversaries may abuse SQL stored procedures to establish persistent access to systems."
    },
    "T1556.004": {
        "name": "Network Device Authentication",
        "description": "Adversaries may use [Patch System Image](https://attack.mitre.org/techniques/T1601/001) to hard code a password in the operating system, thus bypassing of native authentication mechanisms for local accounts on network devices.\n\n[Modify System Image](https://attack.mitre.org/techniques/T1601) may include implanted code to the operating system for network devices to provide access for adversaries using a specific password."
    },
    "T1561.001": {
        "name": "Disk Content Wipe",
        "description": "Adversaries may erase the contents of storage devices on specific systems or in large numbers in a network to interrupt availability to system and network resources.\n\nAdversaries may partially or completely overwrite the contents of a storage device rendering the data irrecoverable through the storage interface.(Citation: Novetta Blockbuster)(Citation: Novetta Blockbuster Destructive Malware)(Citation: DOJ Lazarus Sony 2018) Instead of wiping specific disk structures or files, adversaries with destructive intent may wipe arbitrary portions of disk content."
    },
    "T1213.005": {
        "name": "Messaging Applications",
        "description": "Adversaries may leverage chat and messaging applications, such as Microsoft Teams, Google Chat, and Slack, to mine valuable information."
    },
    "T1048.003": {
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "description": "Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel."
    },
    "T1027.015": {
        "name": "Compression",
        "description": "Adversaries may use compression to obfuscate their payloads or files."
    },
    "T1574.004": {
        "name": "Dylib Hijacking",
        "description": "Adversaries may execute their own payloads by placing a malicious dynamic library (dylib) with an expected name in a path a victim application searches at runtime."
    },
    "T1601.002": {
        "name": "Downgrade System Image",
        "description": "Adversaries may install an older version of the operating system of a network device to weaken security."
    },
    "T1078.003": {
        "name": "Local Accounts",
        "description": "Adversaries may obtain and abuse credentials of a local account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion."
    },
    "T1669": {
        "name": "Wi-Fi Networks",
        "description": "Adversaries may gain initial access to target systems by connecting to wireless networks."
    },
    "T1211": {
        "name": "Exploitation for Defense Evasion",
        "description": "Adversaries may exploit a system or application vulnerability to bypass security features."
    },
    "T1127": {
        "name": "Trusted Developer Utilities Proxy Execution",
        "description": "Adversaries may take advantage of trusted developer utilities to proxy execution of malicious payloads."
    },
    "T1529": {
        "name": "System Shutdown/Reboot",
        "description": "Adversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems."
    },
    "T1218.014": {
        "name": "MMC",
        "description": "Adversaries may abuse mmc.exe to proxy execution of malicious .msc files."
    },
    "T1564.010": {
        "name": "Process Argument Spoofing",
        "description": "Adversaries may attempt to hide process command-line arguments by overwriting process memory."
    },
    "T1077": {
        "name": "Windows Admin Shares",
        "description": "Windows systems have hidden network shares that are accessible only to administrators and provide the ability for remote file copy and other administrative functions."
    },
    "T1574.012": {
        "name": "COR_PROFILER",
        "description": "Adversaries may leverage the COR_PROFILER environment variable to hijack the execution flow of programs that load the .NET CLR."
    }
}